{"Lect 6 - Class Notes.txt": [{"page_number": 0, "text": "\n\n\n\n\n, where D = drag\n\n\nVelocity deficit created by the B.L. is the physical origin of the drag force!\nVon Karman defined this relationship in 1921! \n\nOur Goals for Today (lect. 6)\nA very fast review of derivation of Bernoulli eq. with emphasis on non-steady form of the equation\nInvitation to self-study notes for Sec. 3.6 and 3.7 (angular momentum and Energy formulations of RTT)\nStarting Chapter 4 and introducing differential forms of conservation of mass & momentum\n\nSec. 3.5 Bernoulli Equation\n\n\nWill not consider shear stress or the wall, So ONLY frictionless flow\n\n\n\nWriting RTT for momentum Equation (2):\n\nAn element of an infinite section:\n \n \n \n\n\n\n\n – along the streamline\n - integrate over starred variable\n - integrate over starred variable\n\n\n à constant in time\n à \n à \n\n\n à \nWhere  à \n \n\n\nDue to mass conservation, these terms cancel each other, see Eq. (1) : , \nOn the other hand, forces on stream tube element are pressure & gravity so,\n\n à gauge pressure only; for a small angled tube, approx. dPdA\n\n\n\n\nEquation (15) is unsteady frictionless along a stream tube (to write for a streamline, we put stream on a diet!)\nIf we consider flow is steady state, then \nIf we consider fluid to be incompressible (ρ = constant), Then I can simply write à decoupling P & ρ\nSo, integrating between 2 points, 1&2:\n\nNOTE: In deriving Equations 15 & 16, we used conservation of mass & momentum but NOT conservation of Energy! à so, if heat or work are added/removed from c.v., Then equations (15&16) are not applicable. Do NOT use!\n\nObservation:\nFrom 16: \n\n à pressure head\n à dynamic head (velocity head)\n à static head\nH à Head\nSee Figure 3.13\n\n\n2. If the change in Z is negligible, then Equation 16:\n\n à static pressure\n à dynamic pressure\nà Total pressure (stagnation pressure)\nLook at the exp. 3.16 in the textbook.\n\n\nSec. 3.6 – Angular Momentum Theorem:\nIn systems like pumps and turbines where flow rotates, the linear may not be very useful for analysis. Also, anywhere that there is a misalignment between fluid flow and force line of action.\nNote a fluid is deformable unlike a solid, so angular momentum should be written on elemental basis:\nSo,\n\nRotation about point “o”\n\nFrom RTT\n\nFrom mechanisms, we know: \n\n à summation of moments for all forces (gravity, pressure, etc.) around “o”\n\nMost problems can be treated as 1D intel/outlet and analyzed in steady conditions.\nSo:\n\nOtherwise, one must use a differential approach (see Chapter 4) and use computers to solve equations numerically.\n\nSection 3.7 – Energy Equation\nThis is our 4th law to consider:\nEnergy (e) has several forms: , and many other chem., elec., …\nUsually, we deal with the 1st 3 types:\nWork (w) can usually have 3 forms:\nWshaft\nWpressure à \nWviscosity à \n\nThe heat (Q) has normally 3 forms: , but in this course we mainly deal with isothermal flows (no details for heat transfer)\nUsing RTT with \n\nWhere h = enthalpy =  à pressure work brought from LHS to RHS\n\nFor steady, 1D flow:\n\n\n\nEvaluate as an average over the in/out area\n\nPay attention to the how c.v. is selected to make the analysis a simple flow in à flow out problem.\nNo need to consider pressure as live action passes through “O”, so momentum is generated\nThe same as 2 is true for normal component of velocity vector\nAssume 1D flow due to defined c.v., then use Eq. 18\n\n\n à Torque\nSteady flow: \nQ à Flow rate\n\n à where sin90 = 1; clockwise\n \nFrom (1):  à clockwise\n\nKnowing that  & \n à clockwise; Euler equation of pump\nDo part (b) on your own.\n\nChapter 4\n\nChapter 4: Differential Approach to fluid flow\nSec 4.1\nSome math reminders!\nRemember \n\nBut u = u (x, y, z, t)\n\nWhere \nAside:  (Operator!)\n\n\n\n\nSame way  and  can be found\nFinally: \n à local term\n à convective term due to e.g., change in geometry. Note: particles of fluid have relative motion w.r.t. one another unlike solids.\n\nSo even a steady flow, can have acceleration because of convective term (e.g., steady flow through a converging nozzle)\n\n\nHow about Pressure?\nP = P (x, y, z, t), so in general:\n\nAside: In an isotropic flow: \nLet’s write on 4 laws to do differential analysis for flows:\nSec 4.2 Conservation of Mass\n\nNOTE: All other pair of sides will also have mass flow into/out of them, but for graphical clarity not shown\nWriting similarity for z & y directions AND considering the mass charge over time within the element (i.e., ) that must be balanced to zero (to satisfy conservation of mass):\n \n\n \n\n\nIf the flow is incompressible, regardless of whether or not it is steady\n\n\n\nExample: An inviscid flow through a 60˚ angle elbow. Here are the flowing velocity components\n\n\nWhere a & b are constants\nIf flow is incompressible, what is the velocity component v?\nSolution: The flow everywhere should satisfy conservation of mass, momentum, etc. Looking at conservation of momentum, i.e., Equation 5 or 6, one can find v knowing u & w, so:\n\n\n\nWhere f (x, z, t) à arbitrary function\n\nASIDE: If the Mach number of flow is below 0.3, then any flow (gas or liquid) can be considered incompressible; so far air flow below ≈ 300km/hr in normal atmosphere is considered incompressible.\n\nLet’s do the 2nd law in Fluid Mechanics: Conservation of Momentum\n\nWhat type of forces act on this element?\nChange in momentum in any x, y, or z direction over the element\nBody force (e.g., gravity, electrical, magnetic, etc.)\nSurface Forces\nHydrostatic pressure (P)\nViscos stresses ()\n\n1 Momentum Flux\nConsider the x-direction\n\n\nNot momentum flux in s-direction: \nSame can be done for the other two direction (i.e., y & z)\n\n2 Gravity\nOnly in y-direction\n\n\n3a Hydrostatic Pressure\nConsider x-direction\n\n\nNet force =   (isotropic flow)\nNegative direction can be seen by arrow in element.\nThe same treatment can be done for other directions.\n\n3b Viscos Stresses\nConsider x-direction\n\n à normal stress due to shear forces\n\nNet force due to shear in x-direction = \nSame for other directions à a viscos stress term!\n\nConsider 2nd law of Newton: \nLet’s write it in the x-direction:\n\n\nWhere,  à hydro-static pressure and  is viscos.\nIn the y-direction:\n\nWhere,  à due gravity\n\nIn the z-direction:\n\n\nEquations (7-9) are general momentum (linear) equations in 3D\n\nFor inviscid flow:\n\n\n\n\n\n\nEuler Equations for fluid flow\nEquations (7-9) can be recasted for Newtonian fluids by relating shear to the rate of change of velocity in space (x, y, z), using the concept of viscosity.\nThe 3D treatment of viscosity for an incompressible fluid is:\n\n\n\nSubstituting above relationships for τ into equations 7-9, one has:\n\n\n\nWhere, , , and  are the convective term & it is a non-linear differential equation.\nRHS if equations are the inertial terms\n\nEquation (11) is called Navier-Stokes Equation for incompressible fluids.\n\nSec 4.4 Differential Equations of Angular Momentum (3rd flow)\nLet’s consider the notation around centroid of an element (O, i.e., where z-axis crosses the x-y plane)\n\nIf I write the equation for moment calculation, I find that:\n\nFor rotation around y or x axes, one finds:\n\n\nThe above means that there is no differential equation form for conservation of angular momentum à one should use the integral forms given in chapter 3.\nNote 1: P, , , and  all pass through the centroid of the element (O) so they have momentum around O.\nNote 2: Fluid similar to solids experiences symmetric shear stresses.\n\nSec. 4.4 Differential Equations for Conservation of Energy (4th Law)\nIt can be shown that the conservation of energy equation for an element will be equation (12):\n\n\n à defined in chapter 3\nNote: There is no infinitesimal shaft work (a mechanical shaft cannot be the size of an element)\nNeed to find differential forms of  and \n\nHeat Transfer to the Element\nTo deal with , we only consider conduction (vast application only have conduction)\nFourier’s Law for Conduction\n or in general (3D)\n\n\n\n\n\n\n\n\n\n\n"}], "Lect 8 - Irrotational Flow.txt": [{"page_number": 0, "text": "No flow in  dir --> no eqs. In dir. Since \nz-dir.\n\n\n\n\nIntegrate w.r.t  r  twice:\n\n\nTo avoid any singularity at = finite value\n denominator (dr) is the 2nd B.C.\n        |centerline of pipe\n1st B.C. no slip at R = pipe radius\nUsing the 2 B.C. :\n\nEq. Of a paraboloid \n\n\nNote: Knowing the profile allows one to find:\nFlow rate , ie.  where \nShean at the wall (Twall) : Twall = \nL = length of pipeline segment\n\n\n\nOur goals for today (Lect 8):\n\nSolving a sample problem using differential forms of conservation equations\nIrrotational flow and velocity\n\n\nNote: Since there is no temp change (energy or work in/out), then we don’t concern ourselves with energy e.q (also because we’re not concerned with losses) (term in energy e.q)\nAssumptions:\nNewtonian fluid, steady flow\nNo variation of Vel. In 2dir --> 2D flow\nNo rotation --> no worries for conservation angular momentum --> continuity inear momentum \n\n\n\n\n\n\n\n\nNote: looking from the top and side views of the system--> u >> v or w, so we can neglect v and w or v=w=0\nMomentum:\n\n\n\n\nContinuity:\n\nNote, v=0\nB.C. to solve\n1. y=0\tu=U\n2. At free surface shear force  is zero mechanical balance\n\n at interface y=5\n3. Since we have a flat interface with air at y=5 --> p=0, gauge at m.\nSolve above PDF with the 3 B.C.\nAns. \n\n\n\n\nNote: N.S eqs are complicated, so to find analytical solutions, either if the phys of problem allows, simplification, e.g probably above, or use of math. Tech should be done to find solution, otherwise CDF is needed.\n\nIrroration Flow and Vorticity\nThese concepts are math. Tech to help with finding analytical solution to PDE of N.S.\nSee videos\nIf a fluid element does not have an angular vel. Around its centre, this flow is called irrotational\n\n\n\n\n\nAvg rotational of element around 2 axis  :\n\n\n\nBy trigonometry, it can be shown:\n     and       \n\nThen, \nFor rotation around x and y axis, it can be shown:\n\tand \t\n\n\n\nVoracity = \n\nIf or zero voracity, the flow is irrational\n\nWhat is this good for?\nWe have a math tool to solve for flow field (get v, u, p...)\n*This tool is best suited for 2D flows where there is no work or heat involved since there is no work or heat, I can be concerned with conservation of man and momentum:\nFor an incorporable flow of, where flow is steady:\n\t(I)\n\n\t(I)\n\n\n\n\n\t(ii)\n\nConsider a function exists (note ) that one can write:\n\t(iii)\n            ^u\t         ^v\t\tkind of like substitution of variable T in match\n\nThen by inspection of eg (iii) vis.a.vis eg(I):\n\tand \t\t(19)\n\nIf one takes the curl of momentum eg (I.e [eq (ii)]), and use definition from Eq 19, then:\n\t(iv)\n\nEq (iv) is a 4th order PDE that needs 4 B.C.\nAside the driving eq (iv) :\n\n\nSpecial Case:\nIrrotational flow --------------->  \nin 2D\n\nEq (iv) row simplifies to a 2nd order PDE, which needs 2 B.C. only\nB.C:\tconst at body\n const\t(at far field--> very much away from the object)\n\n\n\n\n\nInterestingly, represents streamlines in a physical sense, hence it's called stream function\nDefinition of a streamline: \nSatisfies \t\n\nIt can be shown that:  --> scaler\n*or  if we write the above same formulation but keep the in the equation (I)\nTherefore, the concept of stream function works for both compressible and incompressible flows, but not for 3D or unsteady flows\n\nEX. If a stream function exists for vel. Field as follows, find it, plot it, and interpret it\n\nLooking at the vel. Function --> flow is 2D and it’s independent of \nTime --> Steady --> Chance exists\n\nTo find  :\n\t,     const\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}], "Lect 9 - Potential Flow.txt": [{"page_number": 0, "text": "Lecture 9 – Potential Flows\n\nWhen flow is both frictionless and irrotational  momentum eq, I.e. eq 11 reduces to Euler’s eq.\n\nEuler’s equation is much simpler to solve and it can be very useful for low aerodynamic (as least on a 1st estimate), low vel gas flow, or low vel and low vel gradient conditions for liquid flow, eg. Flow in domestic drainage lines\nIf flow is irrational, a scaler function, , can be defined as:\nWhich is called vel potential\nFrom a vector analysis theorem: \n\nWhat is good for?\nIt reduces the prob of solving for 3 variables, u, v, w, into a dingle variable, , in the x, y, z domain\n\nLines of constant are called “potential lines of flow” and they are normal to streamlines \n\tand \t\nUnlike , can be used in 3D as well\n\nQuestion: How to find the flow pattern around the tornado?\nAnswer: Use of elemental flows, such as: uniform flow, sink/source or pure vortex, etc.\nUniform Flow\nA uniform flow in only x-direction (I.e. 1D)\n\n\t(Did not write the const of integration as recall is a const)\nAt const, x, line const lines\n\n\n \t(const y gives lines)\n\n\n\n\nSink/Source Flow\nSuppose z-axis was a thin pipe issuing/sucking flow along its length, them from x-y plane, we have:\n\nUsing pilar coordinates\n\t(“m” is strength)\t\n(“b” is the virtual thicken in z-dir)\n\n\nAfter integration and \nConst are radical lines\nIf --> source\nIf --> sink\n\nLine Irrotational Vortex\nA pure 2D line vortex is a circulating steady motion\n \tonly and \t\nIf flow is irrotational \t(“k” is a const)\n\nIntegrate: \tand \t\n“r”: Const r lines and stream lines\n““: const lines, I.e. potential lines\n\n\n\nNote:\nThe above equations for and are all from linear PDEs\nThen the sum of their solution is “a solution” as well concept for super position!\n\nHow to make a sink tornado as shown? \t\t\t\t\t\t\nThink of rotation of flow --> vortex\nThink of drainage of flow --> sink\n\n           see figure:\n\nWhen \nBut in reality, there is a viscosity (however small) and near center the vel gradient is extremely large, so this combination means that the assumption of frictionless flow will breakdown and solution is NOT valid near the center and at the center \n\nExample:\n\nIf we consider a source at x=0 and a uniform flow:\nAside: How to “shape”\n\n\nInfact combination of a source at x=0 and a uniform flow will provide he Rankine body as follows:\n\n\n\t(I)\n““ --> polar coordinate\n--> uniform flow\n--> source\nNote:\nThe steam line crosses (a no no for streamlines!!)\nBut now it is allowed since they cross at stagnation point when vel is zero\n\nCombining eg (I) and (ii), and considering the Figure above (the top part of it, to represent the bump for our problem):\n\n\nTo find cartesian vel components\n\t(iii) --> both of these equations\n\n\nAt stagnation point  from eq (iii), one finds  or 180º and  or  from above figure\nVel everywhere can be founds as: --> magnitude of velocity\n\t(iv)\nm/s\nNote:\n\n\n --> area for unit length out of page\n\nBernoulli equation along the streamline  can be applied:\n\n\nWe assume Vb = 2.5, as it is down in horizontal section of flow similar to the uniform flow (slip condition holds as flow is considered frictionless)\n\n\n\nObservation:\nSince we used different approach, we can able other questions such as where is max vel on the bump, since we have access to details of flow field in the different approach\n\nMax vel point on the body , after differentiation can be found that is on this point is the min pren. point \nThe min pren point lecoation is the most important as flow reversed downstream of the location many happen that can give rise to formation of flow separation and appearance of eddies (see chap 7 later)\n\nNOTE: Stream function and vel potential function method of analyzing fluid flow through combination of elemental flows is like rapid prototyping seen in manufacturing. One gets a quick but approximate feel/knowledge for flow field to make descriptions\n\n\n"}], "Lecture 1.txt": [{"page_number": 0, "text": "First Lecture\nWho is stronger a solid or a fluid?\n\n\nOur Goals for Today (lect. 2)\nUnderstand shear stress in liquids\nViscosity & its temperature and pressure dependance\n\nBefore we start... What are we after in Studying Fluid Dynamics?\nPressure field/values\nVelocity Field\nWork\nForces\nPower\nLosses\nPressure\nDrag/resistive force\n\nWhat is the main difference between a solid and a liquid?\nFluids do not keep their shape under any stress\nStems from ability of liquid molecules to move around\n\nAside: the terms Fluid Dynamics and Fluid Mechanics are used interchangeably in this course and mean largely the same thing\n\nSolid vs Fluid\nA solid can resist a shear stress (τ) by a static deformation, but a fluid cannot!\nWhat happens when a fluid experiences a shear stress?\nIt flows!\n\n\nAt a given time, δt, The larger the τ, the larger will be δθ, so \n\nA constant shear stress, causes a strain (δθ) that is changing with time, at a rate of .\nEq (1) à \t\tNewton’s law for viscosity\nWhere  is the viscosity (proportionality constant)\n\nViscosity is the resistance of a fluid to motion.\nà  unit is  or \n or 1 cP (centi-poise)\n \nViscosity is a thermodynamic property, so: \nWhere T = temperature and P = Pressure\n changes significantly with temperature.\nFor gases,\n\nKnown  at  (273K)\nn is a constant (for air 0.7)\n\nBut for liquids,  decreases with temperature\n\na and b are constants that depend on the type of liquid\nwhy different between gas & liquid?\n, and P↑ so does  for all fluids.\nIf  is divided by fluid density (ρ), it is called kinematic viscosity (v).\n )\nFor water v = 1c or \nIn fluid mechanics, we’re not interested in strain rate (unlike solid mechanics), but care about velocity distribution  with in the fluid. Let’s see how we can match strain to velocity. \n\n à (for small strains & elements) \n\t\t\t\t\t\tà \n\n\nFrom Eqs. (2 & 3):\n\n\n\n\n\n \n\n\n\nExample: Skating on ICE!\nLet’s assume ice between skate and surface is melted. What is the relative profile within the liquid film?\n\nAssumption:\n\n1 – The flow is one dimensional in x-direction, i.e. u(x) = u(z) = 0, u(y) ≠ 0\n2 – no pressure variation in x direction\nLet’s consider force balance over a fluid element\n \nFrom force balance \n\nIf the person is not accelerating, then  is a constant,  is a constant (water), then the integral can be solved as:\n\nB.C.\nat y = 0  u = 0  a = 0\nat y = h à u = v  v = 0 +  è \n\n (linear velocity profile)\n\nSummary for today’s lecture\n\n\nViscosity charge with T&P\nIntermolecular forces is the origin if viscosity\nDifference between solid & liquid in terms of strain\nProportionality between velocity & shear stress\n\nOur Goals for Today (lect. 3)\nNon-Newtonian Fluids\nVarious ways to study fluid dynamics\nNewtonian vs Non-Newtonian Fluid\n"}], "Lecture 10.txt": [{"page_number": 0, "text": "Emperical Fluid Dynamics & Dimensional Analysis \n(DA)\nChapter 5 of F. White’s Fluid Mech Book\nLearning Goals:\nIntroduction to empirical (experimental Fluids Dyn.)\nLet’s look at two experiments:\nDrop impact onto a surface\nDrop transfer between to surfaces\nHow to construct Dimensionless numbers\nHow to use Dimensionless numbers in:\nPlanning for experiments\nInterpreting the data from experiments\nSimilarity of Flow in Fluids Dynamics and its application\nWhy Study Drop Impact on Surfaces\n \n\n\n\n\n\n\n\nLubrication of big ship engines\n\nA drop impacting a dry solid surface under normal atmospheric conditions!\n\nT=0\nT = 0.3 ms\nT= 2.6 ms\nT = 6.6 ms\nT= 14.6 ms\nT =750 ms\n\nA drop on to solid dry isothermal surfaces\n\n\n\n\n\n\nInfluence of Gas Pressure\n\n\nSurface roughness influence\n\n\n(silicon oil) \nWettability influence on drop impact \n\n\nIsothermal Impacts of Newtonian drops\n\n\n\nDrop Impact parameters: how to reduce them \n\nU,D, and time t\n\nWe (inertial/superficial forces) \nOh (viscous / superficial forces) \nRe (inertial viscous forces) \nExample: atmospheric Water Drop \nV = 50 M/S\nD = m\nWe = 1700\nOh = 0.03\n\nDA for Data Analysis/Interpretation\n\nExample of liquid bridge case for printing industry:\n\nIndustrial Application \n\nOther applications\nDispensing of glue for packaging\nElectro wetting-assisted drop deposition\nMicromachined fountain-pen techniques\n\n\nIn Nature: \nCat laps\nLiquid adhering to the dorsal side of the tongue tip is drawn upward, forming a liquid bridge. \n\nProcess of liquid transfer from one surface to another\n\n\nTypical process of liquid transfer\nTransfer ratio- \n\n\nGoverning parameters for the transfer ratio:\nDonor Surface: Teflon AF\nAcceptor surface: PMMA\nStretching speed (U): 25 mm/s\n\nDonor surface: Teflon AF\nAcceptor surface: PMMA\nStretching speed (U): 1mm/s\n\n\nDonor surface : Silicon\nAcceptor Surface: PMMA\n Stretching speed: 1 mm/s\n\n\nWhat maybe parameters of interest?\nliquid viscosity\nSeparation velocity of surfaces\nSurface tension of liquid\nType of surfaces\n\n\n20 cSt silicone oil: \n\n100 cSt silicone oil:\n\nRoles of liquid viscosity\n\nFour types of silicon oil transfer from Teflon AF to PEMA\n\nWhat nondimensional parameters we can use?\nCapillary number Ca (Ca = ) [viscos forces over surface tension forces]\nTransfer Ratio as Function of Lof (Ca)\n\nEffects of liquid surface tension\n\n\nGoals for today’s lecture – Lecture 10\nIntroduction of 3rd way to study fluid dynamics, i.e., empirical studies\nDiscussion of an experiment and parameters that can be involved\nHow to handle many parameters tjat can be involved in an empirical study\nDimensional Analysis as a way of interpreting data and managing experiment parameters in a study\nChapter 5: Dimensional Analysis (DA) & Similarity\nDA id basically a way to reduce the numbers of variables to allow for planning on data interpretation in/from an experimental worK. \nDA saves time and money, as we can reduce the number of experimental runs. Experimental work is an important part of F.D. as many cases are too complex in mission critical to use analytical or CFD methods (alone).\nNote: Read Sec. 5.1 & 5.2 \\\nSec. 5.3 The Pi Theorem\nWe will use Ipsen method rather thanBuckingham method to do the DA. In DA we create non dimensional compound variables, out of dimensional variables. The non-dimensional compund varibales are called Pi (due to symbol - π). \nIf phenomenon (e.g. drag on airfoil) depends on “n” dimensional variables (e.g. velocity, density,etc), the DA reduces the problem to “K” dimenisonaless parameters (e.g. C_D & R_e).\nGenerally n – k is equal to number of fundamental (or basic) dimensions (e.g. M,L,T, etc) something\nDo you know some non-dimensional variables?\n, ,  (specific heat)\nThe non-dimensional varibales usually have or signify physical meaning, e.g.\nRe =  signify how much inertial forces should be longer than viscours forces to transmit turbulent flow.\n (We #)\n, \nDrag coefficient \nHow to use this information to make plans for experiments?\nHow to use this information to interpreat data?\n\n\nPlanning: should I worry about liquid surface tension when designing a channel flow?\nChannel dimensions: 30 x 20 xm and 2m long\nFlow velocity: 0.1 m/s\nLiquid: water or ethanol \nWhich # to use? We\nInertia is N42 times more important than surface forces.\nWhat if the channel is angled (effect of gravity) ?\nSo not important at all\n\nHow about viscous forces?\nNot to worry about viscous forces , \nWhat if the velocity B is reduced to 1mm/min -> ,  now vicous forces are more important.\nHow about surface forces ?\nSurface forces are the King/Queen in µ channel.\n\nSo such planning analysis will allow us to plan betetr; for a large channel surface tension will not be a design/experiment consideration, but for a micro-channel it should be!\nOnce data is collected in an experiment, say rag force coefficient for a sphere or a cycle. Non-dimensional plot, allows a comprehensive representation of data; as seen in figure below, the plots are independent of the fluid used (e.g.,µ,), so it can be for air, water, oil, etc. No more rad for 3 plots for air, oil, water...\n\n\nAlso, data interpretation in terms of e.g. forces, with a plot such as the one above can be made in general fashion (e.g. regardless of the type fo fluid); see encircled areas in the above plot where an increase inertoal forces leads to reduction of forces on the cycle or spherical body in any fluid flow ()\n\n\nHow to make non-dimensional groups (π) or numbers. \n\n"}], "Lecture 12.txt": [{"page_number": 0, "text": "Lecture 12 Notes\nChapter 11:\n\nGoals for today - Lecture 12 \n1. What is a pump and its applications \n2. Discussion of different types of pumps and their characteristics \n3. Best Efficient Operating point (BEP) for pumps \n\nSec 11.1\nPumps:\nPositive Displacement Pump (PDP)- pushes the liquid by compressing it against a cavity, with an opening suddenly becoming available.\nRotodynamic Pump(RP): Pushes the fluid by adding momentum to it by means of a fast moving blade\nPDP advantage: \nworks with any liquid (viscos or not, Newtonian or not)\nhas constant (almost) flow for any system head\nPDP disadvantage:\nusually low Q\npulsating/unsteady flow (unless a settlement tank is used)\nRD advantage:\nsteady flow\nhigh flow rates compared to PDP\nvariable flow depending on the system head\nRD diasvantages:\nNeeds “priming” unlike PDP. Priming means that the pump needs to be filled with liquid to start, i,e, to suck liquid\nModerate pressure\nHigh viscous liquids (or shear thickening) will degrade the pump performance, significantly.\n\nTypes of Pump Video:\n\n\nVideo for working Centrifugal Pump:\n\n\nGood video to watch to understand how different pumps work!\n\n\nSee Figs. 11.1-11.3 & 11.6 & 11.7 & 11.3\n\nFig 11.6 7 11.7:\nPump curves are strictly for a given fluid\nAt low  Const. (but pump is inefficient)\nMax  is at  0.6\nMax  point is called BEP (Best Efficiency point) and one should aim for running the pump at BED."}], "Lecture 13 Notes .txt": [{"page_number": 0, "text": "Lecture 13 Notes:\n\nGoals for today- Lecture 13\nCavitation in pumps \nPumps and their characteristics Net Positive Suction head \nPump Non-dimensional parameters, i.e. coefficients of capacity, head, and power \nSeries and parallel pumps \n\nNet Positive Suction Head (NPSH):\nIn a pump curve, NPSH defines under what condition, the pump will cavitate i.e.  where  saturated pressure for liquid at given temp.\n\nCavitation Video:\nCavitation ‐Easily explained! \n\nIf fluid will boil flow will become bubbly\n(cavitation) pump vibration, extra noise, pitting of vane/blades since bubble will burst on the travel to the high press. Side (i.e. exit of pump)\n\n*cavitation must be prevented always\n\nCondirion to avoid cavitation (1)\n\nNPSH-> read from pump performance curves\n  total flow head\n available NPSH\n\nUsing Bernoulli for a pump intake place above a reservoir\n (2)\n both minor and major losses\n\nAlways design for hot condition!!\n\nSec 11.2: Basis Pump Formulas:\n\nPower delivered to the fluid \nPower delivered to the pump (BHP) \nPump designer wants to maximize this \n(3)  \n volumetric, Q that is last due to clearance between casing and vane/impeller/blades\n hydraulic, frictional loss over blades/vanes, outlet …\n mechanical efficiency (bearing, etc.)\n\n\n flow rate at outlet\n recirculated flow in the pump due to clearances\n\n\n frictional losses inside the pump\n total static head of the pump\n\n\n\n frictional losses of power due to mechanical components\n \n\nDimensional Pump Parameters:\n\n RPM,   roughness\n\n\nEliminate the dimensions\n (4)\n CH Coefficient of head\n\n (5)\n\n Cp coefficient of power\n CQ coefficient of capacity\n\n\nIn practice, due to high turbulence, is show to have little effect, and experiment show that for many pumps, viscosity (for a given fluid) has the same percentage effect, i.e.  term can be discounted for similarity analysis see fig.11.8\n (6)\n[For geometrically similar pumps using the same liquid]\n\nAlso,  so ,  is a finction of  as well\nSuctioned \n\nConsidering above similarity rules( ) for pump will be: (7)\n\n\n\n\nEq(7) can be used to estimate the effect of changing parameters such as  etc. on Q, P & H\n\nNote: Although due to similarity principals, one expects , but in practice (effect of  on has (8):\n\n\nLarger purmps or higher Re (Q) will improve slightly the \n\nNote: Viscosity changes the pump p[performance drastically (see fig.11.10); There is no general eq. for, but needs testing.\n\nParallel & Series Pumps:\n\nParallel:\n\n\nEach pump in a parallel arrangement should meet the required head individually\nLittle limitation on number of pumps to be in parallel\nSeries:\nParallel:\n\n\n\nCannot have too many pumps in series due to pressure limitation for pump casing\n\nSee Figs, 11.9\n\nFig. Chap 11\nBasic principles and history of industrial pumps\n\n\nBreast Pump \n\n\n\n\n  \nPiping system characteristic curve to intersect pump char. curve at or near BEP to have an efficient pumping system\n\nFig 11.10\n\nGiven curve by CQ\nFig 11.8\n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\nIntroduction to Computational Fluid Dynamics (CFD Analysis):\n\nAirfoil:\nAirfoils are used various for various applications, from turbines blades to airplane wings\n\nExample- simplified airfoil cross section\nFor example, this section of a wing can be simplified into a 2 dimensional airfoil for easier analysis.\n\nFor this example we will use the following values & assumptions: \nFluid is air \nVelocity at inlet is 100 m/s \nNo slip condition on airfoil surface Assumptions: \n2-dimensional \nSteady State \nIncompressible \nAtmospheric pressure at end of controlled volume\n\nPhysical vs. CFD:\nNotice in CFD we analyze the surrounding volume of fluid, not the solid the airfoil \nThis is a controlled volume analysis, \nWalls of the CV needs to be defined (yellow lines/curves) \nthe walls must be at a reasonable distance from the airfoil to avoid the flow to be altered by the walls.\n\n\nCFD Analysis:\nThere are many commercial and open source CFD codes \nFluent (by ANSYS) \nOpen Foam \nStar‐CCM+ \nSome are specialized (FINE/Marine), some are more general (Fluent)\n Percentage of Respondent 2016\n\n\nOverall structure of CFD analysis\nThe general process for performing a CFD analysis according to NASA: \nFormulate the Flow Problem \nModel the Geometry and Flow Domain \nEstablish the Boundary and Initial Conditions \nGenerate the Grid \nEstablish the Simulation Strategy \nEstablish the Input Parameters and Files \nPerform the Simulation\nMonitor the Simulation for Completion \nPost‐process the Simulation to get the Results \nMake Comparisons of the Results \nRepeat the Process to Examine Sensitivities \nDocument\n\n\n  L. Jawad Aziz, M. T. Nasret, Int. J. Sci& EnggRes, 5, 143, 2014\n\nWe will use Fluent in this course\nTo make the geometry you can use Solidworksand then import to Fluent\nIt is available in the counsels under ANSYS software package in Petire Building room 020 (the computer labs)\n\nCreating the geometry for analysis The geometry can be created in SolidWorks, but then has to be imported in ANYSYS   After importing, click “Generate” for the object to appear and finish the importing process \n\n\nMesh \nNow that there is a geometry, we can divide it into elements.\n \nMesh shape \nThe mesh was generated using an automatic method, which resulted in 234 elements. \nNote that the elements are smaller in the highlighted section, this is because the program predicts greater velocity and pressure gradients in front of the airfoil.\n\n\n\nFluent \nNow that we have defined the geometry and the mesh size, we can continue to edit our case in “Fluent”, where we’ll set all the parameters to solve.\n\n\nTwo Dimensional Flow:\nContinuity  \nNavier-Stokes\n\n\n\n\n\n  0\n 0\n 0\n 0\n\n\n\n\n\n\n\n\nDefine Steady State\n Continuity(steady flow)\n 0\nNavier-Stokes (steady flow):\n\n \n\n\nDefine Incompressible Flow:\n Continuity (Incompressible Flow)\nNavier-Stokes(Incompressible Flow)\n\n \n\nDefine material\nA material can be selected (in this case air), or any other material with user defined properties (UDF), this allows the user to later apply the material for the system\n\nThis option assigns the material to the system, in the fluid region\n\nDefine material Density (ρ) and viscosity (μ) are known:\n\n \n\nBoundary Conditions:\nNow that the material is known and the equations to be used are simplified, we can specify the boundary conditions:\nContinuity(Steady and Incompressible Gas)  \nNavier-Stokes equations (constant density and viscosity)\n\n \n\n\n\nBoundary conditions cont’d:\nInlet velocity: \nu and v are known, u = 100, v = 0, at the inlet\n \n Outlet pressure \nPressure is know\n\n\n\nNo slip condition on walls: \nZero velocity on first fluid layer\n \nFinite Volume Technique (Fluent)\nDivide the domain into control volumes (elements)\nThis is the mesh we created \nIntegrate the differential equation over each control volume and apply the divergence theorem\nTo evaluate derivative terms, values at the control volume faces are needed:\nhave to make an assumption about how the value varies (this is called initialization) –different from Boundary Conditions.\nAll above results in:  a set of linear algebraic equations \nNote each element is providing 3 PDE in our example, we have 100s of elements (see the mesh), so the matrix will be a large one to solve \nSolve iteratively or simultaneously. \n \n \n\nThe problem is now all setup:\n\nResiduals \nThe residuals are errors due to discretization of a continuous domain into mesh and solving over each element \nUsually an acceptable tolerance for this errors should be set  --this called sometimes convergence criterion \nThe equations were allowed to have an error of 110 \nTo start,  It is a good idea to start with the default values in the software for the convergence criterion.  \nIn the FLUENT residuals are reported for each conservation equation.\n \n\nThe problem is now solved \n\nResults – Pressure contours;\n\n\n Results –Velocity Vector Field \n \nResults –Pathlines by Velocity Magnitude\n\n\nHow would the results change if the vane was lifted by 30˚ ?\n\nVelocity field   -sensitivity/design analysis\n\nStreamlines\n The end!"}], "Lecture 17 Notes.txt": [{"page_number": 0, "text": "Lecture 17: Drag notes:\nEvaluate the range of boundary-layer thickness between laminar and turbulent\n Blasius(1908)\nLaminar: or in\n\nTurbulent:  or  Ans.(a)\n\n(b, c) Evaluate the range of boundary-layer drag for both laminar and turbulent flow\nNote that, for flow over both sides, the appropriate arca A=2bL:\n\n Ans.(b)\n\n Ans.(c)\nTurbulent drag is about 4 times larger than laminar drag\nTo find a more accurate measure of drag, one needs to break the plate into two parts: \nArea 1 where drag force is calculated using laminar formula and the corresponding area \nArea 2: where drag force is calculated using turbulent formula and the corresponding area \nAdding the drag force from areas 1 and 2 \n\nTo find the area 1, one needs to use the 103 for Re and solve for L (the length Where transition from lam. To Turb. Will take place \n\n \nGoals for Lect. 17 \n1. External flow: Drag force \na. Types of drag force (skin & pressure) \nb. How to calculate drag force \nc. What factors affect drag force\n\n\nExperimental External Flows:\nThe B.L. Theory is only useful for flat plate to determine the separation, but for all other shapes, CFD, or likely Exp. Are used.\nOne is always concerned with forces on a body (e.g. airfoil, ship, building) over which an external flow exist.  \nDrag acts along the axis parallel to the free strem\n\nRolling moment moment around the free stream axis\n\nDrag Force Depends on:\nFlow conditions, turbulent or laminar\nGeometry of the object, e.g. airfoil, or cyl. Or cube\nOrientation of flow w.r.t. to the body\n\nDrag Force and angle of Attack:\nThe angle between the chord and direction of free stream flow is called “angle of attack”(: usually for airplanes (or wind turbines) this is max 10 drag. The higher the  the higher the possibility of separation high drag!\n\nComponents of Drag Force:\nDrag force has two components usually:\nFriction Drag:  This is the summation wall stresses or the “skin” of the body. Obviously friction or skin drag is the result of B/L\n\nPressure Drag: If flow separates, a low press. Region will be seen in the rear of an object; as such a “drag force” will be seen due to pressure differential in the front of the object (stagnation point region) and the rear of the object(separation region)\n\n coefficient of drag due to pressure; \n oonly cyl.\n\n\n\nOuter stream grossly perturbed by broad flow separation and wake\n\n\nPressure drag not total drag, stream function calculation from chapter 5 N/10 for switch one of Cp between lam and Tub. Flow\n\nNotes on Components of Drag Flow:\nNote 1: Friction (skin) drag is always present (since B.L. is always present), BUT pressure drag is noticeable when separation occurs!\nNote 2: separation is seen\nHigher Re or vel.\nMis-orientation of free stream and object’s geometry, e.g. high  values\nThickness of object/bluntness of corners etc.\n\nNote 3: The contribution of press. And fiction drag to total drag varies, e.g. a flat plate will have 100% friction drag as a percentage of total drag; where as a friction and pressure drag are each 50% for an object of dimension shown below\n\n\n\n\n\n\nHow to Calculate the Drag Force:\nTo evaluate drag force, usually drag coefficient (CD) Is used. CD is found mostly experimentally or by CFD.\n\n motion of kinetic energy/pressure\n characteristic area\n\nAccounts for both friction and press. Drag,\n\n pressure\n friction\n\nCharacteristic Area in Drag Force \nThe area A is usually one of three types: \nFrontal area, the body as seen from the stream; suitable for thick, stubby bodies,  such as spheres, cylinders, cars, trucks, missiles, projectiles, and torpedoes. \nPlanform area, the body area as seen from above; suitable for wide, flat bodies such as wings and hydrofoils. \nWetted area, customary for surface ships and barges.\n\n\n\nFrontal Area in Drag Force\n\n\nNote:\nThe frontal area should be calculated w.r.t. The normal to the direction of free flow stream (i.e. the projected one of the object on the plane normal to the free stream flow axis)\n\ne.g. if the flow is frontal of the above airfoil, the A=S x C (Planform Area or if  then \n\n\nWhat Affects Drag Force?\nFlow conditions\nSeparation point on a cylinder differs from laminar vs. turbulent flow\nThink of dimples on golf ball to force(trip) flow from lam. To tub. To reduce Cp to have the ball travel further due to less drag.\n\nGeometry of the object: stream lining\n\n\n\n\n\nSee Example 7.6\nDrag Force in Creeping (Stokes’) Flow (Re<<1)\nWhen Re<<1 \nAcceleration terms in N.S. eqs. Are negligible.\nViscous stream is dominant    since high \n\nMomentum eq. simplifies due to 1) as: ,  continuity incomp. Fluid\nFor simple shapes above eqs. Can be solved as they are linear O.D.E’s\n\nStokes solves them for a sphere and found CD theoretically as:\n,  dia. Of sphere,  sphere in creeping flow\nAccounts up to \n      dia. Of sphere\nSee problem 7.725\n "}], "Lecture 18 Notes.txt": [{"page_number": 0, "text": "Lecture 18 Notes:\nLect 18 – Goals for today’s lecture\nDrag force for low Re (creeping flow) \nIntro. To Lift Force \nHow to calculate lift force & factors affecting lift force \nRelationship between CD and C L\nThe concept of stall \nRole of flaps in changing CD and CL \nFinite versus infinite wing and the effect on CD and CL \n\nDrag Force in Creeping (Stokes’) Flow (Re<<1)\n\nWhen Re<<1 \nAcceleration terms in N.S. Eqs. Are negligible\nViscous stream, is dominant since high \n\n\nMomentum eq. simplifies due to 1) as: ,  continuity incomp. Fluid\nFor simple shapes above eqs. Can be solved as they are linear O.D.E’s\n\nStokes solves them for a sphere and found CD theoretically as:\n,  dia. Of sphere,  sphere in creeping flow\nAccounts up to \n      dia. Of sphere\nSee problem 7.725\n\nLift Force:\nLift force is the force that an object in an external flow experience in the normal direction to the drag force.\nUnlike drag force that is mostly to be avoided (reduction of losses), lift force is a desirable force. Drag is only useful to stop an object. E.g., parachute\nLift force is usually associated with useful work.\nNote: If lift force is in the negative y direction, sometimes it is called downforce\n\nThe lift force allows an airplane to take off and remain afloat in the air or a wind turbine to twirl and produce mechanical work to run a generator.\n\nMoment around a lift force axis is called yaw.\n\nLift Force Resulted from Pressure Differences:\nLift force is normally produced as a result of pressure differential between two sides of the object w.r.t. the drag force plan\nIf the 2D body is symmetric w.r.t. incoming free stream flow no lift is produced as Ptop=Pbottom\n\nIf the 2D body is not symmetric w.r.t. incoming flow, then lift is produced\n\nLift Force Calculation:\nLift coefficient(CL) concept is used to calculate Lift Force (L) similar to CD used for drag force calculations but the area used is diff.\n where  platform(ex. Wing area)\n is found by experiments (eg. NACA NASA has a large publicly available values) or by CFD\n\nWhat affects ?\nRe, α, and shape (similar to CD)\nFor airfoils or hydrofoils, there is a sweet spot where  CL is max and CD is min to produce the max work or performance\nFor common airfoils:\n\nSee Figs. 7.24 & 7.25\n\nA pilot usually wants to fly at 1.2Vs, where  Vs stall value and α<12°\nRecall: The use of flaps were to increase the lift at lower vel. So for ex., stall can be avoided. (stall was significant loss of lift force due to a) redirection of speed b) angle of attach)\n\nTheoretically it can be show that:\n(CL Theory)  where  deg., 2hmax. combos, c chord length (1)\n\nStall Vel: ,  lift, W weight, CL max\n, CL max\n\nTwo Complicating Factors for Lift Force Calculation:\nTapered wing shape\n    b span of wing\n\nFinite span\nThe CL values in plots are for a 2D airdoil (infinite span)\nAspect Ratio = AR =\nAR can come α to increase (effective )\n(2)\nCombining Eqs. 1 & 2\n\nThe associated drag increase is \nOr ,  infinite span\n\nFigs Chap 7:\n\n \nNozzle: \nDecreasing \npressure \nand area \nIncreasing \nvelocity \nFavorable \ngradient \n\nThroat: \nConstant \npressure \nand area \nVelocity \nconstant \nZero \ngradient \n\n \nDiffuser: \nIncreasing pressure \nand area \nDecreasing velocity \nAdverse gradient \n(boundary layer thickens) \n\nFigure 7.24\n\n\n\n\nFigure 7.25:\n\nFigure 7.26:\n\nFlaps:\n\nFigure 7.28:\n\n\nFinite wing Versus Infinite Wing:\nTwo benefits of wing let increase lift (a bit), decrease drag by weakening the vorticious\nWing let (reduces vortex)\nDone poorly winglets, can increase flow separation and skim drag despite the feet that vorticious one reduced.\n\n\n\n\n"}], "Lecture 19 - notes Fanno Flow.txt": [{"page_number": 0, "text": "Chapter 9\nLecture 19 – Goals for today’s class\nReview of the thermodynamic properties for compressible gasses (must watch the video posted below)\nApplication of Compressible flow\nIntroduction to compressible duct flow with friction\nDerivation of the relationships for compressible flow stated in 3\nSolving a problem\n\nWatch this video from Min 1:00 to 51:00 to remind yourself of the preliminaries from Thermodynamics you need for Compressible flow:\n\n\nThe notes below do not include the material related to the review that was provided through YouTube videos above. Make sure that for that purpose you read sections 9.1 to 9.3 of the Whites textbook.\n\nSection 9.7 – Compressible Duct Flow with Friction\nNote that for compressible fluids, pressure is not simply the mechanical normal stress, but a well-defined thermodynamic variable. Therefore, the drop in pressure is caused not only by the friction of the fluid, but also by the change in the thermal state.\n\nv + dv à no change in cross section, no change in mass flow à so other properties must change (e.g., ρ, T, P) to have v form inlet to change to v + dv in outlet.\n\nLet’s make these assumptions to find analytical solutions:\nSteady 1D flow\nNo shaft work & potential changes\nWall shear stress is correlated by Dancy friction factor (f), i.e.,\n\nAdiabatic Flow\nConsidering the conservation laws: \n\n à appearing become of compressibility.\n\n\ndx à element length (see Figure above)\nx-momentum energy , where \ndespite being adiabatic, temperature can change à \n\n\nIn above 3 equations we have P, ρ, T, v, ; Assumption 3 above given a 4th equation AND if we restrict the analysis to gases, then ideal gas law PV=nRT can be read.\n\nIntegrating/solving above 5 equations will give:\nEquations 9.64 a-e\n\n\n\n\n\n\nThis type of flow is called Fanno flow!\nThe term (1-) appears in above equations, so depending on whether  (supersonic),  (sub-sonic), the flow properties vary diff., see table:\n\n à always decrease as there is losses () at the wall\nEntropy à S always increases otherwise violation of 2nd law of thermodynamics\n\n\nWhere do you see Fanno flow?\nEmptying of pressured container through a relatively short tube, exhaust system of an internal combustion engine, compressed air systems, historically it raised from the need to explain the steam flow in turbines.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSonic Properties\n\n\n\n\n\nFrom 9.14 one will see that\nS became  at \nSince flow is non-isentropic (frictionless losses);  decreases (see table above), so ref. properties should be sonic properties\ni.e.,  \nSo, integrating between o and  (length of tube when ) of say Eq. 9.64e\n\nWhere,  = Average f between o & \n\tD à can use \n\tK à gas constant (air h = 1.4)\n\nTable B.3 has numeric values of  for various .\nIf  does not reach 1, i.e., the dual is short. Then eq. (2) can be used:\n\nFind ‘f’ from Moody diagram for Average  &  values.\n\n\n\nNote 1: see ex. 9.10\nNote 2: Equations 9.68a – 9.68d in the textbook give relationships for , etc. on a function of  & K, similar to Equation (1) above.\nThe values, e.g., for Pressure, between two points, can be found using:\n\nWhere , etc. can be found from equations 9.68 or table B3 in appendix of textbook.\n\nLecture 20 – Goals for today’s class\nAdiabatic flow cont’d: Chocking of compressible flow in a duct due to friction\nIsothermal Compressible flow with friction in a duct\nSolving a problem\n\n\nChocking Due to Friction\nWhat happens if the length of the duct is longer than  for a given Ma at the inlet?\nSubsonic: the inlet vel adjusts down so at exit , \nThis means the length can determine the main flow rate\nSupersonic: A shock will appear at the “right place”, to turn flow subsonic, and hence at exit \n\n\nNote: Increasing the Ma at inlet, beings the shock closer to the inlet; think of why?\nHint: Length of duct to have at exit for a “subsonic” flow\n\nNote: Minor losses for compressible flow are calculated as:\n\n : pressure after the fitting\n: minor loss coefficient for comp flow (an approx. might use the k values from sec 6.9. of test) (3)\nV : vel after the fitting\n\nIsothermal flow with Friction:\nFor very long ducts, e.g natural gas lines, the flow takes the state of isothermal rather than adiabatic. In this case, the conservation of energy e.q is replaced by T = const or dT = 0 in the set of eqs given for adiabatic flow\n\nIt can be shown that\n\t(4)\n\nTwo differences between the isothermal and adiabatic frictional flow:\nIn isothermal, the flow behavior does not depend on inlet Ma being sub- or super-sonic (I.e no more term)\nThe Lmax is not zero when Ma=0, but according to the above equation when . So the limiting Ma at the exit will be  (0.845 for air) for isothermal flow\n\nWhat if \nSimilar to adiabatic flow, if inlet is subsonic, the Ma at inlet will decrease, so exit Ma is ; and if inlet is supersonic, then a shock at the “right place: will appear, so the exit Ma is still \nNote: The ref properties will be values of etc at  (not ), I.e. \nSome useful formulae for isothermal flow:\n\t; \n\n\n\n : mass flux at inlet P1 or ext P2 (static pressure)\n\nExample:\n\nFlow should be treated as “isothermal” due to very long pipe!\n\n\n\nR for air = 287J/kg.k\n\nNow all value to use in Eq 5 above is known to find G\n\n\n\n"}], "Lecture 5 RTT-review-Examples-Bernouli.txt": [{"page_number": 0, "text": "4. If heat (Q) is transformed to or from the surrounding OR if work (W) is done or by surrounding on the system, then from 1st law of thermodynamics: \n\nor\n             (4)\nEq (4) is a scalar equation.\nEx. Work extracted by turbine from a gas stream. \n5. The 2nd law of thermodynamic, Eq(5) should be obeyed:\n                                (5)\nDs is the entropy and T is the temperature.\nNote: Not very practical in fluid Dynamics, unless you are studying details of flow loss.\n\n(equations)\n\nNOTE: In general flow velocity id a vector, i.e. variable in time and space:\nV(x,y,z,t) = \nWhere, \n\n\nAnd acceleration of flow (a) is: a=\n       “total differential”\n\nQuestion – How to use differential equations above to do a central velocity level analysis?\nAnswer - \nRTT may be different in form depending on, if:\nc.v. is fixed\n\nc.v. is moving\n\nc.v. is deformable\n\n\n\nFixed c.v.\n\n\nv . N= VdAcos(theta)\ndt – at a given instant\ncos (theta)  - will determine if flow is in pr out to c.v.\ntheta = 90: flow is along the streamline\n-90 < theta < 90   out flow\n90 < theta < 270  in flow\nWe can extend the above concept to any intensive fluid property (denoted by B). Note B can be a scalar or a vector. \nAside intensive property is one that its value does not depend on the mass\n(e.g. vel.). so:                   (7)\nwhere, dB – amount of B in an element\ndm – mass of the element\nFrom equation (6):    (8)\n From equation (7) & (8):    (9)\nEquation (9) represents the elemental flux rate of property B into /out of c.v. crossing the C.S.\n (10)\n (10a)\nEquation (10a) is the practical form of Equation (10).\nConservation law mean that:  (11)\nwhere, rate of change of B within the Vel. - \nAnd flux rate in/out of c.v is : \nAside from equation (7):               (12)\nFrom equations 10 –12:\n         (13)\nEq(13) is the RTT relating the time derivative of a property (B) to the c.v. level properties!\nSo we can do system level (integral) fluid mechanics for equations 1 – 4 without the need for knowing the flow details at every point of c.v.\n\nGoals (lect 5):\nReview of Reynolds Transport Theorem (very fast!) \nSolve problems \nBernoulli Eq\nExample 1: Water enters a short conduit at a vel of 10 m/s as shown below. What is the water vel at exit?\n\n\n\nFrom equation (1) : \nAssume flow at inlet and outlet are 1D flow (i.e main in x-direction). Assume water is incompressible \n( ) \nAssume the flow is steady state, so V is constant in time\nEq (13): d/dt (B_sys)\n\n\n\nExample 2: Find an expression for the rate of change of height shown in figure below:\nThe issue is the mass of water in the tank (\nWhere are constants\n\n\nFrom eq (13): \nFrom eq(1):  \n\n\nIn flows :\n\n\nMass of air trapped:  \n\n2 – Moving C.V\nIf c.v. is moving at vel., Vs., and observer fixed to the c.v., sees a relative vel. ( V_r) of fluid crossing the c.v\n, where V_r is the relative vel of fluid, V is the fluidal absolute and V_s is the c.v. absolute velocity.\nRTT will have the form of Eq (13), just replace V with V_r\nNote: V_s may be a constant, or a function time (variable vel) , V_s(t), which means V_r can be a constant, or a function of time, I.e, V_r(t), respectively. \n      (14)\n3 – Deforming & moving c.v\nIf c.v is deforming & moving, then [Vector of space], so . \nAgain the form of RTT eq. Doesn't change from eq (14), but it’s integration becomes more complicated... you may need to use Matlab to solve the integral. \nIn Ex. 2, one could have chosen c.v as shown below:\nStill mass (m) is of interest \n\n\n\nNotice although with time, the top surface od c.v moves (I.e. cv deforms), but surface where there is flow/flux (inlets ans outlets) placed stay stationary in time, so V_s = 0, and V_r will be the same as V, so....\n\nExample 3: What is the magnitude of F and its angle w.r.t horizon ( ); id a fluid jet impacts the value as shown. No friction as pressure change exists.\n\n\nAssumption:\nIncomplete flow\nSteady state\nThe jet doesn’t expand as travels over the vane\nNo losses\n\n\n13 will be \nThe c.v is defined as a fixed c.v. are eq 13\n\nNote we do not consider friction on the cane, so V_1 = V_2 = V\n [ - : inflow, + : outflow](note: in = )\n\n      (theta that jet exists the vane)\n\n\nExample 4: What is the drag force on a wing with dimensions (bxl) in a steady state air flow?\nLet’ simply the wing is a flat plate\nLet's assume flow is 1D in x-direction\n\nWe know that a boundary ;ayer (B.L) will form and grow on a plate exposed to V_infinity (See fig above)\n\nEq (2)  \n\n\n\n\n\n\n\n\nF = - D (drag)\n\n\n\n\nVel. Deficit created by the B.L. is the physical origin of the drag force!\n\nVan Karman derived this relationship in 1921!\n\nSec. 3.5 Bernoulli Eq. \n\t Will not consider stream stress on the wall, so ONLY frictionless flow\n\nWriting RTT for momentum Eq (2):\n\n\n\n\nAnd element of an infinitesimal section: \n\n\n\nAlong the streamline - \n(Integrate over starred variables)\n\n\n\n\n\nThese terms - , due to massconservation the terms cancel each other out, see Eq(1)\nOn the other hand, forces on stream tube element are pressure & gravity\nSo ,\n\n\n - for an small angled tube, approx dpdA\n\n\n\n, \n\n              (15)\n\nEq(15) is unsteady frictionless along a stream tube (to write for a stream line, we put stream on a diet!)\nIf we consider flow is steady state, then \nIf “   “ fluid to be incompressible (), then I can simply write dP = P2-P1 : decpupling P&P\nSo, integrating between 2 points, 1 & 2:\n                (16)\n\nNOTE: In deriving Eqs. 15 ^ 16, we used conservation of mass & momentum. But not conservation of enerygy ! => So, if heat or work are added/renewal from c.v., then there Eqs (15 & 16) are not applicable. \nDO NOT use!\nObservations: \nFrom 16: \n\nSee fig 3.13 \n \n\n2.If the change in Z is negligible, then Eq (16):\n, take a look at the exp. 3.16 in the text book.\n\nSec. 3.6 - Angular Momentum Theorem:\nIn system, like pumps; turbines where flow rotates, the linear may not be very useful for analysis. Also, angular that there is a miss-alignment between fluid dlow and force line of action.\nNote a fluid is deformable unlike a solid, so angular momentum should be written on elemental basis;\nSo, \n   (17)\n\nFrom RTT\n\n\nFrom mechanics, we know: \n\nSummation of moment for all forces (gravity, pressurem etc.) around O\n\n  (18)\n\nMost patterns can be treated as 1D inlet/outlet and analyzed in steady conditions\nSo:\n                     (19)\n\nOtherwise, ore must use differential approach (see chap 4), and use computers to solve Eqs. Numerically.\n\n\nSec 3.7 - Energy Eq.\nThis is our 4th law to consider\nEnergy (e) has several forms:\n r_2\n, and many others chem, elec,…\nUsually are deal with the 1st 3 types:\nWork (w) can usually have 3 forms: \n\n\n\nThe heat (Q) has normally 3 forms: but in this course we mainly deal with isothermal flows ( no details for heat transfer)\nUsing RTT with  \n\nWhere h is the enthalpy =     (- press. Work brought from LHS to RHS)\nFor steady, 1D flow:\n\n( - - evaluate as an average over the in/out area)\n\nExample 3.18 : \n\nPay attention to how the c.v is selected to make the analysis a simple flow in -> flow out problem\nNo need to consider pressure as lfluid passes through “O”, no momentum is generated\nThe same as 2 is true for normal component of velocity vector\nAssume 1D flow due to defined c.v., then use Eq.18\n (where T is the torque)   (I)\nSteady flow:  \n (clockwise)\n\nFrom (I) :  (clockwise)\nKnowing that \n   clockwise  - Euler equation of pump \n\nDO PART (b) ON YOUR OWN"}], "Lecture 7 Notes.txt": [{"page_number": 0, "text": "Lecture 7 Notes:\netc. etc.\nSubstituting above relationships for  into Eqs. 7-9, one has:\n- \n\n\nUnderlined In Blue: Convectine term & it is non-linear diff. Eq.\nUnderlined In Red:inertial terms\nEq(11) is called Navier-Stokes Eq for incompressible fluids\nEq(11) is usually solved by CFD Techniques (Computational Fluid Dynamics) due to non-linearity – only a few analytical solutions exists\nOur Goals for Today (lect. 7) \nCont'd Chapter 4 and introducing differential form of conservation of Angular momentum & energy\nSolving sample problems using differential forms of conservation equations\nIntro. to irrotational flow & vorticity (time permitting)\nSec. 4.4 – Diff. Eq.s of Angular Momentum (3rd law)\nLets consider the notation around centroid of an element (0, i.e. where Z axis crosses the x-y plane\nIf I write the quation for moment cqlculation I find that\n\nFor notation around y or x axes, one finds:\n\nThe above means that there is no diff. Req. Form for conservativation of angular momentum  one should use the integral form given in chapter 3\nNote 1: all pan through the centroid of the element(0) so they have no moment around 0.\nNote 2: Fluid similar to solids experfiences symmetric shear stressors.\n\n\n\nSec 4.4. Diff. Eq. For Conservation of Energy (4th law)\nIt can be shown that the conservation of energy eq. For an element will be eq.(12):\n\nNote: There is no infinitesimal shaft wor (a mechanical shaft cannot be the size of an element)\n Need to find differential forms of   &  \nHeat transfer to the element to deal with   , we only consider conduction (vast application only have conduction)\nFourier’s Law for Conduction\n or in general (3D)\n coefficient of thermal conductivity \n\nNote: internal elememtal energy is ignored (e.g. chem. Reaction)\nTh net tranfer to the element in the x-dir.\n  → convetion from heat transfer\nConsidering the conduction in all 3 directions:\n (13)\nFinding Diff/ Eq. For Viscos Work ()\n = shear force x area x corresponding vel.\nSo viscos work ( or viscos disipation) in the x-dir:\n\nViscos wotrk out is: \n\nConsidering all 3 directions:\n\nIn Compact form:\n (14)\nPractical form of Eq(14) where viscos losses are seperate is as follows:\n (15)\n → Viscos-dissipation term (essentially this is flow “losses”\nWhere\n\nOnly for Newtonian fluids\n is always positive (due to all terms having powers of 2), which makes senses, as losses in a flow must be positie to comply with 2nd law of Thermodynamics\nSub in Eqs. (13) & (15) into eq(12), cons. Of energy, and after simplification (note: , and utilizing the conservation of linear momentum:\n(16)\nEq(16) is the general form of conservation of energy for a flow\nIf we consider the flow in comprenible and \n(1)\ndT Total diff. On T(x,y,z,t)\n dissipation term (if the flow is very very slow, it can be ignored)\nHow to solve above equations with 5 unknowns (i.e.  when we have 3 eqs.?\nRead Sec 4.6 of the book to learn about various BC\nEq. of state (idel gas law)\nInlet/outlet info. V, p\nSolid wall→ no slip no. Temp. Jump\nFree interface: vertical vel (w) equity & mech. Force balance at the interface ( ) ; or thermal conditions, e.g. equal temp. or equal thermal flux.\nSec 4.10 (For now we will skip Sec 4.7-4.9):\nRead sec 4.10 for analytically solving some special cases here we deal with the example of a Laminin flow within a pipe.\nEx: What is the vel. Profile in the pipe shown. Assume the flow is laminin, and fully developed. Neglect the gravity and assume the flow is steady and incompressible. As this is a straight pipe flow can be considered axisymmetric.\n\nSo!\nWhat co-ordinate system to use?\nCyl.\nWhat does axial flow means?\nA flow that is fully developed is an axial flow \nWhat does axial symmetry mean?\n\nWhat does it mean that flow is incompressible & =constant\nLet’s start with continuity (cons. Of mass):  in cyl. Coordinates\n(see Sec 4.2) has the form\n\n\n1st term→ incompressible\nand → Zero, since flow was fully developed, i.e. arial flow\n where t-steady,  axisymmetric, z – fully developed\n\nWriting N.S. eq. in Cyl. Co-ordinate r-component:\n\n\n +  (r\n=0 no gravity\n\n\nNo flow in  dire => no eqs. In  dire. since\nZ-dir:\n\n→ steady flow\n=0 no gravity\n\n\nIntegrated w.r.f. r twice:\n\n→ to avoid singularity ar r=0   finite value | =0. R=0 –>centaline of pipr, 2nd BC\n1st BC no slip at r=R, R=pipe radius\n\nUsing the 2 BC\n \nEq. of a paraboloid\n\nNote: Knowing vel. Profile allows one to find: \nFlow Rate (Q), i.e.  where \nShear at the wall (Twall): Twall=     ; L= length of pipe segment prev. Drop along z-dir., for pipe length L.\n\nFig. E6.3.1 shows a coating experiment involving a flat photographic film that is being pulled up from a processing bath by rollers with a steady velocity U at an angle   to the horizontal. As the film leaves the bath, it entrains some liquid, and in this particular experiment it has reached the stage where: (a) the velocity of the liquid in contact with the film is , (b) the thickness of the liquid is constant at a value , and (c) there is no net flow being pulled up by the film as is falling back by gravity). (Clearly, if the film were  to retain a permanent coating, a net upwards flow of liquid would be needed.)\n\nNote: Since there is no temp change (energy or work in/out), then we don’t concern ourselves with the energy eq. (also because we’re not concerned with losses (term ins eq.)\n\nAssumptions:\nNewtonian fluid, steady flow, =constant\nNo variation of vel. In 2 dir. => 2D flow\nNo rotation => no worries for conservation angular momentum => continuity linear momentum\nContinuity- Linear 2D Momentum: \n\n\n\nNote: Orientation being x or y axis for and \nNote: looking from top and side views of the system +> u>>v or w, so we can neglect v & w or v=w=0\nMomentum:\n\n\nContinuity   note v=0\n\nBC to solve\ny=0, u=U\nall free surface shear force(Txy) is zero, mechanical balance:\n\nSince we have a flat interface with the dir. At => P=0; gauge at the moment\n\nSolve above PDF with the 3 BC:\nAnswer:\n\n\nNote: N.S eqs. Are complicated, so to find analytical solution, either if the phys. Y problem allows, simplification, e.g. prob. Above, or use of math tech should be done to find solution Otherwise CFD is needed\n\nIrrotation flow and vorticity\nThese concepts are math. Tech. to help with finding analytical sol. To POE of NS; see videos\n\nIf a fluid element does not have an angular vel. Around its center, this flow is called irrotational\n\nTo do diff. analysis : how irrotationality can be shown mathematically?\n\nAvg. rotational vel. Of element around 2 axis (\n – the sign of operation is the direction of notation 9see fig. above)\n\nBy trigonometry, it can be shown\n\nThen\n\nFor rotation around x & y it can be shown:\n\n\n curl \nVorticity-> \nIf  or zero vorticity, then flow is irrotational (18)\n\nWhat is this good for?\nWe have a math tool to solve for flow field (get …)\nThis tool is best suited for 2D flows where there is no work or heat involved since there is no work or heat, I can be concerned with conservation of man & momentum:\nFor an incompressible flow, where flow is steady: \n   (i)\n   (ii)\n\nConsider a function exists ( that one can write:\n (iii)\n\nThen by inspection of eq.(iii) vis. a. vis. eq(i):\n (19)\n\nIf one taken the curl of momentum Eq. (i.e. , and use  definition from eq. 19, then:\n (iv)\nEq (iv) is a 4th order PDE that needs 4BC\nAside from driving Eq. (iv) \nSpecial Case!\nIrrotational flow => x =0  in 2D    \nEq iv) now simplified to a 2nd order PDE, which needs 2 BC only\nBC (at far field _-> very much away from the object)\nInterestingly, represents stream lines in a physical sense, hence it is called a stream function\n\tDefinition of stream line  satisfy  \n       It can show that with  as flow rate and  scalar\nOR  if we write the above same formulation but keep the  in the eq. (i)\nTherefore the concept of stream function() works for both compressible and incompressible flows, but not for 3D or unsteady flow\n\nEx. If a stream function exists for vel. Field as follows, find it, plot it, and interpret it.\n\n\nLooking at vel. Functions  flow is 2D and it’s independent of time -> steady => chance  exists\n\nTo find  -> \n\n\n \n "}], "Lecture15.txt": [{"page_number": 0, "text": "Goals for Lect. 15\nCont'd from pumps (Chap. 11) Specific speed \nIntroduction to external flow over bodies and its application \nBoundary layer (BL) for external flows and comparison with internal flows \nDisplacement thickness in BL, and time permitting start of discussion about BL equations\nChapter 7 – Flow over Immersed Bodies\n\nThis type of flow is important for:\nAirplanes\nCars, trains\nShips\nBuildings (CN Tower)\nA “shear and no-slip\" zone exists near the surfaces; and away from a surface, flow can be considered inviscid (can use Euler Equations, see chapter 3)\n\n\nA “patching” technique is used to relate the viscous B.L. to inviscid outer flow\nPatch: relate pressure in inviscid region to viscos stress in B.L.\nPatching is not always possible, so to understand the flow experiment or CFD should be used on theoretical treatment is not available e.g. 1 < Re < 1000\n\nCompassion between External & Internal B.L\n\n\n\nSpecial case of low Re < 1000\n\nFlow “sees” the plate & forms a B.L. (aka – viscous region) before reaching the plate\nUsually, this flow is seen for  and only way to study details of flow is by experiment or CFD, “patching” possible.\nHigher Re number flows: In such cases there is possible to find .\nIf flow is laminar,  one can show:\n, x – local on the plate – calculate Re at local x, \nB.L. begins at the plate unlike the case for \n\nFor other bodies above Eq. Will not work ! expermient or CFD\nIf flow is turbulent:    (x for plate)\n\n\nNote a B.L. border is not a streamline (see highlighted region in Fig)\nQ1. Is growing faster in lam or turbant flow?\nQ2. Is larger in lam or turbulant flow?\nSec 7.2\nIn chap. 3, we showed that drag (D) on a plate (bx X) is\n             (1)\n\nVon karman wrote Eq(1) in the form of momentum thickness ()\n                 (2) (Measure of drag)\nWhere \nIs a measure of drag (momentum deficit)\nIt can be shown  (w-wall) (3)\nUp to now all relationships apply to both lam & turbulent flow. But assuming a parabolic form for u(x), Van Karman showed for a laminar flow:\n\nKnowing \nConsidering Eq (3), we get , within 10% of earlier equation for ￼\nQ. Why is there a 10% difference?\nIt can be shown that:\n  [Cf – skin friction coefficient, for plate] , which is accurate within 10%\nNOTE: Read about “Displacement Thickness from your textbook. Displacement Thickness is the displacement of the streamline in the free flow by the B.L. to hold the conservation of the mass valid.\n\n\nSpecific (Sec 11.4)\nIf we eliminate D between , and consider the BEP, it can be shown that:\n              (9), \nwhere n – rps, H*- head at BEP, Q* - flow rate at BEP\nIndustrial version of N’s,   => (Q – gpm (gel/min)\nGiving, \nThe value of Ns is in that indicates what type of pump design (axial centirfugal, mixed) is the must efficient machine for a given H & Q, see fig 11.11\nOne can also find the minute required NPSH, by using\nNPSH specific speed:             (11)\nIF Nss > 1800, pump may cavitate (emperically found)\nConsider a pump geometrically similar to the 9-in-diameter pump of Fig. P11.34 to deliver 1200 gal/min of kerosene at 1500 rpm. Determine the appropriate (a) impeller diameter; (b) shut-off head; (c) maximum efficiency; and (d) BEP horsepower. The pump rotational speed for water is 1760 RPM\n\nNOTE: We’re “cheating” a bit by using similarity going from water to kerosine!\nEq(5)  water\n449 – conversation of gpm to ft 3/9\n1760 – RPM of pump read off chart\n60 – to conv to RPS \n12 – conv. Ft\nReversive (see the note): \nShuff_off Eq(4) \n\nUsingg Eq(8) \n(0.77 - read that off the chart)\nUsing Eq 5 for Cp:\n\nP11.65 An 11.5-in diameter centrifugal pump, running at 1750 rev/min, delivers 850 gal/min and a head of 105 ft at best efficiency (82%). (a)Can this pump operate efficiently when delivering water at 20°C through 200 m of 10-cm-diameter smooth pipe? Neglect minor losses. (b)If your answer to (a) is negative, can the speed n be changed to operate efficiently? (c)If your answer to (b) is also negative, can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min?\n(a)Can this pump operate efficiently when delivering water at 20°C through 200 m of 10-cm-diameter smooth pipe? Neglect minor losses.\nFor water at , \nConvert to SI units: \nCompute Red and f:\n\n(a) Now compute the friction head loss at 850 gal.min and see if it matches the pump head:\n\n\n\n(b) If your answer to (a) is negative, can the speed  be changed to operate efficiently? \nAt BEP, (gH/n2D2) is constant, therefore pump head is proportional to n2.  But the pipe friction loss is also approximately proportional to n2.  Thus, for any speed n, the pipe head will always be about twice as large as the pump head and not operate efficiently\n\n(c)If your answer to (b) is also negative, can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min?\nThis time the answer is Yes. First note the BEP dimensionless parameters, = 1750/60=29.2 rps:\n\nNow combine these with that fact that hf is approximately propotional to n2. In SI units, \n\n(c)If your answer to (b) is also negative, can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min?\n\ninches Ans(c.)\nThis is approximately correct. Check: the pump head is 22.4 m(74 ft) and flow rate is 497 gal/min. For this flow rate, the pipe head loss is 22.3 m (73 ft).\nNOTE: Part (c) is almost independent of n. For example, if n =20 rev/s, the best efficiency converges to an impeller diameter of 0,24 m (9.45 in), with Q323 gal/min and \nFig. Chap 11:\nBasic Principles and History of Industrial Pumps\n\n\nBreast Pump: Ameda:History of the Breast Pump\n\n\n\n\n\n\nPiping system characteristic curve to intersect pump char. curve at or near BEP to have an efficient pumping system. \n\nFig 11.10\n\nGiven curve by CQ\nFigure 11.8\n\n\n\nEuler’s turbomachine equation\n\n"}]}