{"Lect 6 - Class Notes.pdf": [{"page_number": 0, "text": ", where D = drag  Velocity deficit created by the B.L. is the physical origin of the drag force! Von Karman defined this relationship in 1921! Our Goals for Today (lect. 6) 1. A very fast review of derivation of Bernoulli eq. with emphasis on non - steady form of the equation 2. Invitation to self - study notes for Sec. 3.6 and 3.7 (angular momentum and Energy formulations of RTT ) 3. Starting Chapter 4 and introducing differential forms o f conservation of mass & momentum Sec. 3.5 Bernoulli Equation Will not consider shear stress or the wall, So ONLY frictionless flow"}, {"page_number": 1, "text": "Writing RTT for momentum Eq uation (2):  An element of an infinite section:    along the streamline - integrate over starred variable - integrate over starred variable  constant in time    Where"}, {"page_number": 2, "text": "Due to mass conservation, these terms cancel each other, see Eq. (1) : , On the other hand, forces on stream tube element are pressure & gravity so,  gauge pressure only; for a small angled tube, approx. dPdA  Equation (15) is u nstead y frictionless along a stream tube (to write for a streamline , we put stream on a diet! ) If we consider flow is steady state, then If we consider fluid to be incompressible ( ) , Then I can sim ply write decoupling P & So, integrating between 2 points, 1&2:  NOTE: In deriving Equations 15 & 16, we used conservation of mass & momentum but NOT conservation of Energy! so, if heat or work are added/removed from c.v., Then equations (15&16) are not applicable . Do NOT use!"}, {"page_number": 3, "text": "Observation: From 16:  pressure head d ynamic head (velocity head) static head H Head See Figure 3.13 2. If the change in Z is negligible, then Equation 16: static pressure dynamic pressure Total pressure ( stagnation pressure ) Look at the ex p. 3.16 in the textbook."}, {"page_number": 4, "text": "Sec. 3.6 Angular Momentum Theorem: In system s like pumps and turbines where flow rotates , the linear may not be very useful for analysis. Also , anywhere that there is a misalignment between fluid flow an d force line of action . Note a fluid is deforma ble unlike a solid, so angular momentum should be written on elemental basis: So ,  From RTT  From mechanisms, we know: summation of moments for all forces (gravity, pressure, etc.)  Most problems can be treated as 1D int el/outlet and analyzed in steady conditions. So:  Otherwise, one must use a differential approach (see Chapter 4 ) and use computers to solve equations numerically. Section 3.7 Energy Equation This is ou r 4 th law to consider : Energy (e) has several forms: , and many other chem., Usually, we deal with the 1 st 3 types: - Work (w) can usually have 3 forms:"}, {"page_number": 5, "text": "o W shaft o W pressure o W viscosity - The heat (Q) has normally 3 forms: , but in this course we mainly deal with isothermal flows ( no details for heat transfer ) Using RTT with   Where h = entha lpy = pressure work brought from LHS to RHS For steady, 1D flow:  Evaluate as an average over the in/out area"}, {"page_number": 6, "text": "1. Pay attention to the ho w c.v. is selected to make the analysis a simple flow in flow out problem. 2. No need to consider pressure as 3. The same as 2 is true for normal component of velocity vector 4. Assume 1D flow due to defined c.v., then use Eq. 18  Torqu e Steady flow:  Q Flow rate where sin90 = 1; clockwise From ( 1 ) : clockwise Knowing that & clockwise; Euler equation of pump Do part (b) on your own. Chapter 4 Chapter 4: Differential Approach to fluid flow Sec 4.1"}, {"page_number": 7, "text": "Some math reminders! Remember  But u = u ( x, y, z, t)  Where Aside: (Operator!)  Same way and can be found Finally:  local term convective term due to e.g., change in geometry. Note: particles of fluid have relative motion w.r.t. one a nother unlike solids. So even a steady flow, can have acceleration because of convective term (e.g., steady flow through a converging nozzle) How about Pressure? P = P (x, y, z, t ) , so in general:"}, {"page_number": 8, "text": "Aside: In an isotropic flow: on 4 laws to do differential analysis for flows: Sec 4.2 Conservation of Mass NOTE: All other pair of sides will also have mass flow into/out of them , but for graphical clarity not shown Writing sim ilarity for z & y directions AND considering the mass charge over time within the element ( i.e., ) that must be balanced to zero (to satisfy conservation of mass ) :   If the flow is incompressible , regardless of whether or not it is steady Ex ample: An inviscid flow through a 60 angle elbow . Here are the flowing velocity components"}, {"page_number": 9, "text": "Where a & b are constants If flow is incompressible, what is the velocity component v? Solution: The flow everywhere should satisfy conservation of mass, momentum, etc. L ooking at conservation of momentum, i.e., Equation 5 or 6 , one can find v knowing u & w, so:  Where f (x, z, t) arbitrary function ASIDE: If the Mach number of flow is below 0.3, then any flow (gas or liquid) can be considered incompressible; so far air flow normal atmosphere is considered incompressible. nd law in Fluid Mechanics: Conservation of Momentum What type of forces act on this element? 1. Change in momentum in any x, y, or z direction over the element 2. Body force (e.g., gravity, electrical, magnetic, etc.) 3. Surface Forces a. Hydrostatic pressure (P) b. Viscos stresses ( )"}, {"page_number": 10, "text": "1 Momentum Flux Consider the x - direction Not momentum flux in s - direction: Same can be done for the other two direction (i.e., y & z) 2 Gravity Only in y - direction 3a Hydrostatic Pressure Consider x - direction"}, {"page_number": 11, "text": "Net force = (isotropic flow) Negative direction can be seen b y arrow in element. The same treatment can be done for other direction s . 3b Viscos Stresses Consider x - direction normal stress due to shear forces"}, {"page_number": 12, "text": "Net force due to shear in x - direction = Same for other directions a viscos stress term! Consider 2 nd law of Newton: x - direction :   Where, hydro - static pressure and is viscos. In the y - direction:  Where, due gravity In the z - direction:  Eq uations (7 - 9) are general momentum (linear) equations in 3D For inviscid flow:"}, {"page_number": 13, "text": "Euler Equations for fluid flow E quations (7 - 9) can be recasted for Newtonian fluids by relating shea r to the rate of change of velocity in space (x, y, z), using the concept of viscosity. The 3D treatment of viscosity for an incompressible fluid is:   - 9, one has:    Where, , , and are the convective term & it is a non - linear differential equation. RHS if equations are the inertial terms Equation (11) is called Navi er - Stokes Equation for incompressible fluids. Sec 4.4 Differential Equations of Angular Momentum (3 rd flow) sider the notation around centroid of an element ( O, i.e., where z - axis crosses the x - y plane )"}, {"page_number": 14, "text": "If I write the equation for moment calculation, I find that : For rotation around y or x a xes, one finds: The above means that there is no differential equation form for conservation of angular momentum one should use the integral forms given in chapter 3. Note 1: P, , , and all pass through the centroid of the element ( O) so they have mom entum around O. Note 2: Fluid similar to solids experiences symmetric shear stresses. Sec. 4.4 Differential Equations for Conservation of Energy (4 th Law) It can be shown that the conservation of energy equation for an element will be equation (12) :  defined in chapter 3 Note: There is no infinitesimal shaft work (a mechanical shaft cannot be the size of an element ) Need to find differential forms of and 1. Heat Transfer to the Element To deal with , we only consider conduction (vast application only have conduction)"}, {"page_number": 15, "text": "or in general (3D)"}], "Lect 8 - Irrotational Flow.pdf": [{"page_number": 0, "text": "No flow in dir -- > no eqs. In dir. Since z - dir.    Integrate w.r.t r twice: To avoid any singularity at = finite value denominator (dr) is the 2 nd B.C. | centerline of pipe 1 st B.C. no slip at R = pipe radius Using the 2 B.C. : Eq. Of a paraboloid Note: Knowing the profile allows one to find: 1. Flow rate , ie. where 2. Shean at the wall (Twall) : Twall = L = length of pipeline segment"}, {"page_number": 1, "text": "Our goals for today ( Lect 8): 1. Solving a sample problem using differential forms of conservation equations 2. Irrotational flow and velocity energy e.q (also because term in energy e.q) Assumptions: - Newtonian fluid, steady flow - No variation of Vel. In 2dir -- > 2D flow - No rotation -- > no worries for conservation angular momentum -- > continuity inear momentum"}, {"page_number": 2, "text": "Note: looking from the top and side views of the system -- > u >> v or w, so we can neglec t v and w or v=w=0 Momentum:  Continuity: Note, v=0 B.C. to solve 1. y=0 u=U 2. At free surface shear force is zero mechanical balance at interface y=5 3. Since we have a flat interface with air at y=5 -- > p=0, gauge at m. Solve above PDF with the 3 B.C. Ans."}, {"page_number": 3, "text": "Note: N.S eqs are complicated, so to find analytical solutions, either if the phys of problem allows , simplification, e.g probably above, or use of math. Tech should be done to find solution, otherwise CDF is needed. Irroration Flow and Vorticity The se concepts are math. Tech to help with finding analytical solution to PDE of N.S. See videos If a fluid element does not have an angular vel. Around its centre, this flow is called irrotationa l Avg rotational of element around 2 axis :"}, {"page_number": 4, "text": "By trigonometry, it can be shown: and Then, For rotation around x and y axis, it can be shown: and  Voracity = If or zero voracity, the flow is irrational What is this good for? We have a math tool to solve for flow field (get v, u, p...) *This tool is best suited for 2D flows where there is no work or heat involved since there is no work or heat, I can be concerned with conservation of man and momentum: For an incorporable flow of, where flow is steady: (I) (I)"}, {"page_number": 5, "text": "(ii) Consider a function exists (note ) that one can write: (iii) ^u ^v kind of like substitution of variable T in match Then by inspection of eg (iii) vis.a.vis eg(I): and (19) If one takes the curl of momentum eg (I.e [eq (ii)]), and use definition from Eq 19 , then:  (iv) Eq (iv) is a 4 th order PDE that needs 4 B.C. Aside the driving eq (iv) : Special Case: Irrotational flow --------------- > in 2D Eq (iv) row simplifies to a 2 nd order PDE, which needs 2 B.C. only B.C: const at body const (at far field -- > very much away from the object)"}, {"page_number": 6, "text": "Interestingly, represents streamlines in a physical sense, hence it's called stream function Definition of a streamline: Satisfies It can be shown that: -- > scaler * or if we write the above same formulation but keep the in the equation (I) Therefore, the concept of stream function works for both compressible and incompressible flows, but not for 3D or unsteady flows EX. If a stream function exists for vel. Field as follows, find it, plot it, and interpret it Looking at the vel. Function -- Time -- > Steady -- > Chance exists  To find : , const"}], "Lect 9 - Potential Flow.pdf": [{"page_number": 0, "text": "Lecture 9 Potential Flows When flow is both frictionless and irrotational eq. much simpler to solve and it can be very useful for low aerodynamic (as least on a 1 st estimate), low vel gas flow, or low vel and low vel gradient conditions for liquid flow, eg. Flow in domestic drainage lines If flow is irrational, a scaler function, , can be defined as: Which is called vel po tential From a vector analysis theorem:  What is good for? - It reduces the prob of solving for 3 variables, u, v, w, into a dingle variable, , in the x, y, z domain Lines of constant y are normal to streamlines and Unlike , can be used in 3D as well Question: How to find the flow pattern around the tornado? Answer: Use of elemental flows, s uch as: uniform flow, sink/source or pure vortex, etc. 1. Uniform Flow A uniform flow in only x - direction (I.e. 1D) ( Did not write the const of integration as recall is a const) At const, x, line const lines"}, {"page_number": 1, "text": "(const y gives lines) 2. Sink/Source Flow Suppose z - axis was a thin pipe issuing/sucking flow along its length, them from x - y plane, we have:"}, {"page_number": 2, "text": "Using pilar coordinates thicken in z - dir) After integration and Const are radical lines If -- > source If -- > sink 3. Line Irrotational Vortex A pure 2D line vortex is a circulating steady motion only and If flow is irrotational  Integrate: and"}, {"page_number": 3, "text": "lines, I.e. potential lines Note: - T he above equations for and are all from linear PDEs - Then the sum of their solution concept for super position! How to make a sink tornado as shown? Think of rotation of flow -- > vortex Think of drainage of flow -- > sink see figure:"}, {"page_number": 4, "text": "When But in reality, there is a viscosity (however small) and near center t he vel gradient is extremely large, so this combination means that the assumption of fri ction less flow will breakdown and solution is NOT valid near the center and at the center Example:"}, {"page_number": 5, "text": "If we consider a source at x=0 and a uniform flow: Infact combination of a source at x= 0 and a uniform flow will provide he Rankine body as follows:"}, {"page_number": 6, "text": "(I) - -- > polar coordinate - -- > uniform flow - -- > source Note: The steam line crosses (a no no for streamlines!!) But now it is allowed since they cross at stagnation po int when vel is zero Combining eg (I) and (ii), and considering the Figure above (the top part of it, to represent the bump for our problem): To find cartesian vel components (iii) -- > both of these equations"}, {"page_number": 7, "text": "At stagnation point from eq (iii), one finds or 180º and or from above figure Vel everywhere can be founds a s: -- > magnitude of velocity (iv) m/s Note: - -- > area for unit length out of page Bernoulli equation along the streamline can be applied: We assume Vb = 2.5, as it is down in horizontal section of flow similar to the uniform flow (slip condition holds as flow is considered frictionless) Observation: Since we used different approach, we can able other questions such as where is max vel on the bump, since we have access to details of flow field in the different approach Max vel point on the body , after differentiation can be found that is on this point is the min pren. point - The min pren point lecoation is the most important as flow reversed downstream of the location many happen that can give rise to formation of flow separation and appearance of eddies (see chap 7 later)"}, {"page_number": 8, "text": "NOTE: Stream function and vel potential function method of analyzing fluid flow through combination of elemental flows is like rapid prototyping seen in manufacturing. One gets a quick but approximate feel/knowledge for flow field to make descript ions"}], "Lecture 1.pdf": [{"page_number": 0, "text": "First Lecture Who is stronger a solid or a fluid? Our Goals for Today (lect. 2) 1. Understand shear stress in liquids 2. Viscosity & its temperature and pressure dependance Before we start... What are we after in Studying Fluid Dynamics? 1. Pressure field/values 2. Velocity Field a. Work b. Forces c. Power d. Losses i. Pressure ii. Drag/resistive force What is the main difference between a solid and a liquid? - Fluids do not keep their shape under any stress - Stems from ability of liquid molecules to move around"}, {"page_number": 1, "text": "Aside : the terms Fluid Dynamics and Fluid Mechanics are used interchangeably in this course and mean large ly the same thing Solid vs Fluid A solid can resist a shear stress ( ) by a static deformation, but a fluid cannot! What happens when a fluid e xperiences a s hear stress? It flows! At a given time, t, The larger the A constant shear stress, causes a strain ( that is changing with time, at a rate of . Eq (1) Where is the viscosity ( proportionality constant ) Viscosity is the resistance of a fluid to motion. unit is or or 1 cP (centi - poise) Viscosity is a thermodynamic property, so: Where T = temperature and P = Pressure"}, {"page_number": 2, "text": "changes significantly with temperature. For gases, K now n at (273K) n is a constant (for air 0.7) But for liquids, decreases with temperature a and b are c onstants that depend on the type of liquid why different between gas & liquid? , so does for all fluids . If is divided by fluid density ( , it is called kinematic viscosity ( v). ) For water v = 1c or (unlike solid mechanics) , but care about velocity ma tch strain to velocity. (for small strains & elements )  From Eqs. (2 & 3):"}, {"page_number": 3, "text": "Example: Skating on ICE! the relative profile within the liquid film? Assumption : 1 The flow is one dimensional in x - direction, i.e. u(x) = u(z) = 0"}, {"page_number": 4, "text": "2 no pressure variation in x direction F rom force balance If the person is not accelerating, then is a constant, is a constant (water), then the integral can be solved as: B.C. at y = 0 u = 0 a = 0 at y = h u = v v = 0 + ( linear velocity profile ) 1. Viscosity charge with T&P 2. Intermolecular forces is the origin if viscosity 3. Difference between solid & liquid in terms of strain 4. Prop ortionality between velocity & shear stress"}, {"page_number": 5, "text": "Our Goals for Today (lect. 3 ) 1. Non - Newtonian Fluids 2. Various ways to study fluid dynamics Newtonian vs Non - Newto nian Fluid"}], "Lecture 10.pdf": [{"page_number": 0, "text": "Emperical Fluid Dynamics & Dimensional Analysis (DA) Learning Goals: 1. Introduction to empirical (experimental Fluids Dyn.) 2. 3. Drop impact onto a surface 4. Drop transfer between to surfaces 5. How to construct Dimensionless numbers 6. How to use Dimensionless numbers in: 7. Planning for experiments 8. Interpreting the data from experiments Similarity of Flow in Fluids Dynamics and its application Why Study Drop Impact on Surfaces"}, {"page_number": 1, "text": "Lubrication of big ship engines A drop impacting a dry solid surface under normal atmospheric conditions! T=0 T = 0.3 ms T= 2.6 ms"}, {"page_number": 2, "text": "T = 6.6 ms T= 14.6 ms T =750 ms A drop on to solid dry isothermal surfaces"}, {"page_number": 4, "text": "Influence of Gas Pressure Surface roughness influence"}, {"page_number": 5, "text": "(silicon oil) Wettability influence on drop impact"}, {"page_number": 6, "text": "Isothermal Impacts of Newtonian drops Drop Impact parameters: how to reduce them U,D , and time t"}, {"page_number": 7, "text": "- We (inertial/superficial forces) - Oh (viscous / superficial forces) - Re (inertial viscous forces) Example: atmospheric Water Drop - V = 50 M/S - D = m - We = 1700 - Oh = 0.03"}, {"page_number": 8, "text": "DA for Data Analysis/Interpr etation Example of liquid bridge case for printing industry:"}, {"page_number": 9, "text": "Industrial Application Other applications - Dispensing of glue for packaging - Electro wetting - assisted drop deposition - Micromachined fountain - pen techniques In Nature: Cat laps Liquid adhering to the dorsal side of the tongue tip is drawn upward, forming a liquid bridge."}, {"page_number": 10, "text": "Process of liquid transfer from one surface to another Typical process of liquid transfer Transfer ratio - Governing parameters for the tra nsfer ratio: - Donor Surface: Teflon AF"}, {"page_number": 11, "text": "- Acceptor surface: PMMA - Stretching speed (U): 25 mm/s - Donor surface: Teflon AF - Acceptor surface: PMMA - Stretching speed (U): 1mm/s - Donor surface : Silicon - Acceptor Surface: PMMA - Stretching speed: 1 mm/s What maybe parameters of interest? - liquid viscosity - Separation velocity of surfaces - Surface tension of liquid - Type of surfaces"}, {"page_number": 12, "text": "20 cSt silicone oil: 100 cSt silicone oil:"}, {"page_number": 13, "text": "Roles of liquid viscosity Four types of silicon oil transfer from Teflon AF t o PEMA What nondimensional parameters we can use? Capillary number Ca (Ca = ) [viscos forces over surface tension forces] Transfer Ratio as Function of Lof (Ca)"}, {"page_number": 14, "text": "Effects of liquid surface tension Lecture 10 1. Introduct ion of 3 rd way to study fluid dynamics, i.e., empirical studies 2. Discussion of an experiment and parameters that can be involved 3. How to handle many parameters tjat can be involved in an empirical study 4. Dimensional Analysis as a way of interpreting data and managing experiment parameters in a study Chapter 5: Dimensional Analysis (DA) & Similarity DA id basically a way to reduce the numbers of variables to allow for planning on data interpretation in/from an experimental worK."}, {"page_number": 15, "text": "DA saves time and money, as we can reduce the number of experimental runs. Experimental work is an important part of F.D. as many cases are too complex in mission critical to use analytical or CFD methods (alone) . Note: Read Sec. 5.1 & 5.2 \\ Sec. 5.3 The Pi Theorem We will use Ipsen method rather thanBuckingham method to do the DA. In DA we create non dimensional compound variables, out of dimensional variables. The non - dimensional compund varibales are called Pi (due to symbol - If phenomenon (e.g. drag on air C_D & R_e). Generally n k is equal to number of fundamental (or basic) dimensions (e.g. M,L,T, etc) something Do you k n ow some non - dimensional variables? , , (specifi c heat) The non - dimensional varibales usually have or signify physical meaning, e.g. Re = signify how much inertial forces should be longer than viscours forces to transmit turbulent flow. (We #) , Drag coefficient 1. How to use this information to make plans for experiments? 2. How to use this information to interpreat data? 1. Planning: should I worry about liquid surface tension when designing a channel flow? Channel dimensions: 30 x 20 xm and 2m long Flow velocity: 0.1 m/s Liquid: water or ethanol  Which # to use? We  Inertia is N42 times more important than surface forces."}, {"page_number": 16, "text": "What if the channel is angled (effect of gravity) ?  So not important at all How about viscous forces? Not to worry about viscous forces , What if the velocity B is reduced to 1mm/min - > , now vicous forces are more important. How about surface forces ? Surface forces are the King/Queen in µ channel. So such planning analysis will allow us to plan betetr; for a large channel surface tension will not be a design /experiment consideration, but for a micro - channel it should be! 2. Once data is collected in an experimen t, say rag force coefficient for a sphere or a cycle. Non - dimensional plot, allows a comprehensive representation of data; as seen in figure below, the plots are independent of the fluid used (e.g.,µ, ), so it can be for air, water, oil, etc. No more rad for 3 plots for air, oil, water..."}, {"page_number": 17, "text": "Also, data interpretation in terms of e.g. forces, with a plot such as the one above can be made in general fashion (e.g. regardless of the type fo fluid); see encircled areas in the above plot where an increase inert oal forces l eads to reduction of forces on the cycle or spherical body in any fluid flow ( ) How to make non -"}], "Lecture 12.pdf": [{"page_number": 0, "text": "Goals for today - Lecture 12 1. What is a pump and its applications 2. Discussion of different types of pumps and their characteristics 3. Best Efficient Operating point (BEP) for pumps Sec 11.1 Pumps: 1) Positive Displacement Pump (PDP) - pushes the liquid by compressing it against a cavity, with an opening suddenly becoming available. 2) Rotodynamic Pump(RP): Pushes the fluid by adding moment um to it by means of a fast moving blade PDP advantage: - works with any liquid (viscos or not, Newtonian or not) - has constant (almost) flow for any system head PDP disadvantage: - usually low Q - pulsating/unsteady flow (unless a settlement tank is used ) RD advantage: - steady flow - high flow rates compared to PDP - variable flow depending on the system head RD diasvantages: - i,e, to suck liquid - Moderate pressure - High viscous liquids (or shear thickening) will degrade the pump performance, significantly. Types of Pump Video: https://www.youtube.com/watch?v=wsm5zzsBI4s&ab_channel=LearningEngineering Video for working Centrifugal Pump: https://www.youtube.com/watch?v=BaEHVpKc Good video to watch to understand how different pumps work! https://www.youtube.com/watch?v=1huJZ1XChYE&ab_channel=PipingAnalysis See Figs. 11.1 - 11.3 & 11.6 & 11.7 & 11.3 Fig 11.6 7 11.7: - Pump curves are strictly for a given fluid - At low Const. (but pump is inefficient ) - Max is at 0.6 - Max point is called BEP (Best Efficiency point) and one should aim for running the pump at BED."}], "Lecture 13 Notes .pdf": [{"page_number": 0, "text": "Lecture 13 Notes: Goals for today - Lecture 13 1. Cavitation in pumps 2. Pumps and their characteristics Net Positive Suction head 3. Pump Non - dimensional parameters, i.e. coefficients of capacity, head, and power 4. Series and parallel pumps Net Positive Suction Head (NPSH): In a pump curve, NPSH defines under what condition, the pump will cavitate i.e. where sat urated pressure for liquid at given temp. Cavitation Video: Cavitation explained! If fluid will boil flow will become bubbly (cavitation) pump vibration, extra noise, pitting of va n e /blades since bubble will burst on the travel to the high press. Side (i.e. exit of pump) *cavitation must be prevented always Condirion to avoid cavitati on (1) NPSH - > read from pump performance curves total flow head available NPSH Using Bernoulli for a pump intake place above a reservoir (2) both minor and major losses Always design for hot condition!! Sec 11.2: Basis Pump Formulas: Power delivered to the fluid Power delivered to the pump (BHP) Pump designer wants to maximize this (3) volumetric, Q that is last due to clearance between casing and vane/impeller/blades mechanical efficiency (bearing, etc.)"}, {"page_number": 1, "text": "flow rate at outlet recirculated flow in the pump due to clearances"}], "Lecture 17 Notes.pdf": [{"page_number": 0, "text": "To find a more accurate measure of drag, one n eeds to break the plate into two parts: - Area 1 where drag force is calculated using laminar formula and the corresponding area - Area 2: where drag force is calculated using turbulent formula and the corresponding area Adding the drag force from areas 1 and 2 To find the area 1, one needs to use the 103 for Re and solve for L (the length Where transition from lam. To Turb. Will t ake place Goals for Lect. 17 1. External flow: Drag force a. Types of drag force (skin & pressure) b. How to calculate drag force c. What factors affect drag force Experimental External Flows: - The B.L. The o ry is only useful for flat plate to determine the separation, but for all other shapes, CFD, or likely Exp. Are used. - One is always concerned with forces on a body ( e.g. airfoil, ship, building) over which an external flow exist."}, {"page_number": 1, "text": "- Drag acts along the axis parallel to the free strem"}, {"page_number": 6, "text": "Characteristic Area in Drag Force The area A is usually one of three types: 1. Frontal area , the body as seen from the stream; suitable for thick, stubby bodies, such as spheres, cylinders, cars, trucks, missiles, projectiles, and torpedoes. 2. Planform area , the body area as seen from above; suitable for wide, flat bodies such as wings and hydrofoils. 3. Wetted area, customary for surface ships and barges."}, {"page_number": 7, "text": "Frontal Area in Drag Force Note: The frontal area should be calculated w.r.t. The normal to the direction of free flow stream (i.e. the projected one of the object on the plane normal to the free stream flow axis) e.g. if the flow is frontal of the above airfoil, the A=S x C (Planform A rea or if then"}, {"page_number": 8, "text": "What Affects Drag Force? i) Flow conditions - Separation point on a cylinder differs from laminar vs. turbulent flow - Think of dimples on golf ball to force(trip) flow from lam. To tub. To reduce C p to have the ball travel further due to less drag. ii) Geometry of the object: stream lining"}, {"page_number": 10, "text": "See Example 7.6"}, {"page_number": 11, "text": "When Re<<1 1) Acceleration terms in N.S. eqs. Are negligible. 2) Viscous stream is dominant since high Momentum eq. simplifies due to 1) as: , continuity incomp. Fluid Stokes solves them for a sphere and fo und C D theoretically as: , dia. Of sphere, sphere in creeping flow Accounts up to"}], "Lecture 18 Notes.pdf": [{"page_number": 0, "text": "Lect 18 1. Drag force for low Re (creeping flow) 2. Intro. To Lift Force 3. How to calculate lift force & factors affecting lift force 4. Relationship between C D and C L 5. The concept of stall 6. Role of flaps in changing CD and CL 7. Finite versus infinite wing and the effect on C D and C L When Re<<1 1) Acceleration terms in N.S. Eqs. Are negligible 2) Viscous stream, is dominant since high Momentum eq. simplifies due to 1) as: , continuity incomp. Fluid Stokes solves them for a sphere and found C D theoretically as: , dia. Of sphere, sphere in creeping flow Accounts up to  Lift Force: - Lift force is the force that an object in an external flow experience in the normal direction to the drag force. - Unlike drag force that is mos tly to be avoided ( reduction of losses), lift force is a desirable force. Drag is only useful to s top an object. E.g., parachute - Lift force is usually associated with useful work. - Not e: If lift force is in the negative y direction, sometimes it is called downforce - The lift force allows an airplane to take off and remain afloat in the air or a wind turbine to twirl and produce me chanical work to run a generator."}, {"page_number": 1, "text": "Moment around a lift force axis is called yaw. Lift Force Resulted from Pressure Differences: - Lift force is normally produced as a result of pressure differential between two sides of the object w.r.t. the drag force plan - If the 2D body is symmetric w.r.t. incoming free stream flow no lift is produced as P top =P bottom - If the 2D body is not symmetric w.r.t. incoming flow, then lift is produced Lift Force Calculation: Lift coefficient(C L ) concept is used to calculate Lift Force (L) similar to C D used for drag force calculations but the area used is diff. where platform(ex. Wing area) is found by experiments (eg. NACA NASA has a large publicly available values) or by CFD"}, {"page_number": 2, "text": "What affects ? - D ) - For airfoils or hydrofoils, there is a sweet spot where C L is max and C D is min to produce the max work or performance For common airfoils: See Figs. 7.24 & 7.25 A pilot usually wants to fly at 1.2V s , where V s ° Recall: The use of flaps were to increase the lift at lower vel. So for ex., stall can be avoided. (stall was significant loss of lift force due to a) redirection of speed b) angle of attach) Theoretically it can be show that: 1) (C L Theory) where deg., 2h max. combos, c chord length (1) Stall Vel: , lift, W weight, C L max , C L max Two Complicating Factors for Lift Force Calculation: 1) Tapered wing shape b span of wing 2) Finite span The C L values in plots are for a 2D airdoil (infinite span) Aspect Ratio = AR = ) (2)"}, {"page_number": 3, "text": "Combining Eqs. 1 & 2 The associated drag increase is Or , infinite span Figs Chap 7: Nozzle: Decreasing pressure and area Increasing velocity Favorable gradient"}, {"page_number": 4, "text": "Throat: Constant pressure and area Velocity constant Zero gradient Diffuser: Increasing pressure and area Decreasing velocity Adverse gradient (boundary layer thickens) Figure 7.24"}, {"page_number": 5, "text": "Figure 7.25: Figure 7.26:"}, {"page_number": 6, "text": "Flaps: Figure 7.28:"}, {"page_number": 8, "text": "Finite wing Versus Infinite Wing: Two benefits of wing let increase lift (a bit), decrease drag by weakening the vort i cio us - W ing let (reduces vortex) - Done poorly winglets, can increase flow separation and skim drag despite the feet that vorticious one reduced."}], "Lecture 19 - notes Fanno Flow.pdf": [{"page_number": 0, "text": "Chapter 9 Lecture 19 1. Review o f the thermodynamic properties for compressible gasses (must watch the video posted below) 2. Application of Compressible flow 3. Introduction to compressible duct flow with friction 4. Derivation of the relationships for compressible flow stated in 3 5. Solving a pr oblem Watch this video from Min 1:00 to 51:00 to remind yourself of the preliminaries from Thermodynamics you need for Compressible flow: The notes below do not include the material related to the re view that was provided through YouTube videos above. Make sure that for that purpose you read sections 9.1 to 9.3 of the Whites textbook. Section 9.7 Compressible Duct Flow with Friction Note that for compressible fluids, press ure is not simply the mechanical normal stress, but a well - defined thermodynamic variable. Therefore, the drop in pressure is caused not only by the friction of the fluid , but also by the change in the thermal state ."}, {"page_number": 1, "text": "v + dv no change in cross section, no change in mass flow so other properties must change (e.g., , T, P) to have v form inlet to change to v + dv in outlet. 1. Steady 1D flow 2. No shaft work & potential c hanges 3. Wall shear stress is correlated by Dancy friction factor (f), i.e., 4. A diabatic Flow Considering the conservation laws: appearing become of compressibility. dx element length (see Figure above) x - momentum energy , where despite being adi a batic , temperature can change In above 3 equations we have P, , T, v, ; Assumption 3 above given a 4 th equation AND if we restrict the analysis to gases , then ideal gas law PV=nRT can be read. Integrating/solving above 5 equations will give: Equations 9.64 a - e"}, {"page_number": 2, "text": "This type of flow is called Fann o flow! The term (1 - ) appears in above equations, so depending on whether (supersonic) , ( sub - sonic ) , the flow properties var y diff., see table: always decrease as there is losses ( ) at the wall Entropy S always increases otherwise violation of 2 nd law of thermodynamics Where do you see Fanno flow? Emptying of pressured container through a relatively short tube, exhaust system of an internal combustion engine, compressed air systems , historically i t raised from the need to explain the steam flow in turbines."}, {"page_number": 3, "text": "Sonic Properties From 9.14 one will see that 1. S became at 2. Since flow is non - is entropic (frictionless losses) ; decreases (see table above), so re f. properties should be sonic properties i.e. , So, integrating between o and (length of tube when ) of say Eq. 9.64e  Where, = Average f between o & D can use K gas constant (air h = 1.4) Table B.3 has numeric values of for various ."}, {"page_number": 4, "text": "If does not reach 1, i.e., the du al is short. Then eq. (2) can be used:  Moody diagram for Average & values ."}, {"page_number": 5, "text": "Note 1: see ex. 9.10 Note 2: Equations 9.68a 9.68d in the textbook give relationships for , etc. on a function of & K, similar to Equation (1) above. The values, e.g., for Pressure, between two points, can be found using : Where , etc. can be found from equations 9.68 or table B3 in appendix of textbook. Lecture 20 1. Adiabatic 2. Isothermal Compressible flow with friction in a duct 3. Solving a problem"}, {"page_number": 6, "text": "Chocking Due to Friction What happens if the length of the duct is longer than for a given Ma at the in l et? Subsonic: the inlet vel adjusts down so at exit , - This means the length can determine the main flow rate Supersonic: to turn flow subsonic, and hence at exit Note: Increasing the Ma at inlet, beings the shock closer to the inlet; think of why? Hint: Length of duct to have"}, {"page_number": 7, "text": "Note: Minor losses for compressible flow are calculated as: - : pressure after the fitting - : minor loss coefficient for comp flow (an approx. might use the k values from sec 6.9. of test) (3) - V : vel after the fitting Isothermal flow with Friction: - For very long ducts, e.g natural gas lines, the flow takes the state of isothermal rather than adiabatic . In this case, the conservation of energy e.q is replaced by T = const or dT = 0 in the set of eqs given for adiabatic flow It can be shown that (4) Two differences between the isothermal and adiabatic frictional flow: 1. In isothermal, the flow behavior does not depend on inlet Ma being sub - or super - sonic (I.e no more term) 2. The Lmax is not zero when Ma=0, but accordin g to the above equation when . S o the limiting Ma at the exit will be (0.845 fo r air) for isothermal flow What if - Similar to adiabatic flow, if inlet is subsonic, the Ma at inlet will decrease, so exit Ma is ; and if Note: The ref properties will be values of etc at (not ), I.e. Some useful formulae for isothermal flow : ;"}, {"page_number": 8, "text": "- : mass flux at inlet P1 or ext P2 (static pressure) Example: Flow should be  R for air = 287J/kg.k Now all value to use in Eq 5 above is known to find G"}], "Lecture 5 RTT-review-Examples-Bernouli.pdf": [{"page_number": 0, "text": "4. If heat (Q) is transformed to or from the surrounding OR if work (W) is done or by surrounding on the system, then from 1 st law of thermodynamics: or (4) Eq (4) is a scalar equation. Ex. Work extracted by turbine from a gas stream. 5. The 2 nd law of thermodynamic, Eq(5) should be obeyed:  (5) Ds is the entropy and T is the temperature. Note: Not very practical in fluid Dynamics, unless you a re studying details of flow loss. (equations) NOTE: In general flow velocity id a vector, i .e. variable in time and space: V(x,y,z,t) =  Where,  And acceleration of flow (a) is: a=  Question How to use differential equations above to do a central v elocity level analysis? Answer - RTT may be different in form depending on, if:"}, {"page_number": 1, "text": "1. c.v. is fixed 2. c.v. is moving 3. c.v. is deformable 1. Fixed c.v. v . N= VdAcos(theta)"}, {"page_number": 2, "text": "dt at a given instant cos (theta) - will determine if flow is in pr out to c.v. theta = 90: flow is along the streamline - 90 < theta < 90 out flow 90 < theta < 270 in flow We can extend the above concept to any intensive fluid property (denoted by B). Note B can be a scalar or a vector. Aside intensive property is one that its value does not depend on the mass (e.g. v e l.). so: (7) where, dB amount of B in an element dm mass of the element From eq uation (6): (8) From equation (7) & (8) : (9) Equation (9) represents the elemental flux rate of property B into /out of c.v. crossing the C.S.  (10) (10a) Equation (10a) is the practical form of Equation (10). Conservation law mean that: (11) where, rate of change of B within the V e l. - And flux rate in/out of c.v is : Aside from equation (7): (12) From equations 10 12:  (13) Eq(13) is the RTT relating the time derivative of a property (B) to the c.v. level properties! So we can do system level (integral) fluid mechanics for equations 1 4 without the need for knowing the flow details at every point of c.v."}, {"page_number": 3, "text": "Goals (lect 5): 1. Review of Reynolds Transport Theorem ( very fast!) 2. Solve problems 3. Bernoulli Eq Example 1: Water enters a short conduit at a v el o f 10 m/s as shown below. What is the water v el at exit? From equation (1) : Assume flow at inlet and outlet are 1D flow (i.e main in x - direction). Assume water is incompressible ( ) Assume the flow is steady state, so V is constant in time Eq (13): d/dt (B_sys)    Example 2: Find an expression for the rate of change of height shown in figure below: The issue is the mass of water in the tank ( Wh ere are constants"}, {"page_number": 4, "text": "From eq (13): From eq(1):   In flows :   Mass of air trapped:   2 Moving C.V If c.v. is moving at vel., Vs., and observer fixed to the c.v., sees a relative vel. ( V_r) of fluid crossing the c.v , where V_r is the relative v e l of fluid, V is the fluidal absolute and V_ s is the c.v. absolute velocity. RTT will have the form of Eq (13), just replace V with V_r Note: V_s may be a constant, or a function time (variable v e l) , V_s(t), which means V_r can be a constant, or a function of time, I.e, V_r(t), respectively.  (14)"}, {"page_number": 5, "text": "3 Deforming & moving c.v If c.v is deforming & moving, then [Vector of space], so . omes more complicated... you may need to use Matlab to solve the integral. In Ex. 2, one could have chosen c.v as shown below: Still mass (m) is of interest  Notice although with time, the top surf ace od c.v moves (I.e. cv deforms), but surface where there is flow/flux (inlets ans outlets) placed stay stationary in time, so V_s = 0, and V_r will be the same as V, so....  Example 3: Wha t is the magnitude of F and its angle w.r.t horizon ( ) ; id a fluid jet impacts the value as shown. No friction as pressure change exists."}, {"page_number": 6, "text": "Assumption: 1. Incomplete flow 2. Steady state 3. expand as travels over the vane 4. No losses 13 will be The c.v is defined as a fixed c.v. are eq 13  Note we do not consider friction on the cane, so V_1 = V_2 = V [ - : inflow, + : outflow](note: in = )   (theta that jet exists the vane)"}, {"page_number": 7, "text": "Example 4: What is the drag force on a wing with dimensions (bxl) in a steady state air flow? 1. 2. Let 's assume flow is 1D in x - direction We know that a boundary ;ayer (B.L) will form and grow on a plate exposed to V_infinity (See fig above) Eq (2)      F = - D (drag)"}, {"page_number": 8, "text": "Vel. Deficit created by the B.L. is the physical origin of the drag force! Van Karman derived this relationship in 1921! Sec. 3.5 Bernoulli Eq. Will not consider stream stress on the wall, so ONLY frictionless flow Writing RTT for momentum Eq (2):  And element of an infinitesimal section:"}, {"page_number": 9, "text": "Along the streamline -  ( Integrate over starred variables)   These terms - , due to massconservation the terms cancel each other out, see Eq(1) On the other hand, forces on stream tube element are pressure & gravity So ,  - for an small angled tube, approx dpdA  ,  (15)"}, {"page_number": 10, "text": "Eq(15) is unsteady frictionless along a stream tube (to write for a stream line, we put stream on a diet!) If we consider flow is steady state, then ), then I can simply write dP = P2 - P1 : decpupling P&P So, integrating between 2 points, 1 & 2:  (16) NOTE: In deriving Eqs. 15 ^ 16, we used conservation of mass & momentum. But not conserva tion of enerygy ! => So, if heat or work are added/renewal from c.v., then there Eqs (15 & 16) are not applicable . DO NOT use! Observations: From 16:  See fig 3.13 2. If the change in Z is neglig ible, then Eq (16): , take a look at the exp. 3.16 in the text book."}, {"page_number": 11, "text": "Sec. 3.6 - Angular Momentum Theorem: In system , like pumps; turbines where flow rotates, the linear may not be very useful for analysis. Also , angular that there is a miss - al ignment between fluid dlow and force line of action. Note a fluid is deformable unlike a solid, so angular momentum should be wri tten on elemental basis; So, (17) From RTT  From mechanics, we know:  Summation of moment f or all forces (gravity, pressurem etc.) around O  (18) Most patterns can be treated as 1D inlet/outlet and analyzed in steady conditions So:  (19) Otherwise, ore must use differential approach (see chap 4), and use computers to solve Eqs. Numerically. Sec 3.7 - Energy Eq. This is our 4 th law to consider"}, {"page_number": 12, "text": "Energy (e) has several forms: r_2 Usually are deal with the 1 st 3 types: - Work (w) can usually have 3 forms:   The heat (Q) has normally 3 forms: but in this course we mainly deal with isothermal flows ( no details for heat transfer) Using RTT with   Where h is the enthalpy = ( - press. Work brought from LHS to RHS) For steady, 1D flow:  ( - - evaluate as an average over the in/out area) Example 3.18 :"}, {"page_number": 13, "text": "1. Pay attention to how the c.v is selected to make the analysis a simple flow in - > flow out problem 2. No need to consider pressure as l fluid passes through 3. The same as 2 is true for normal component of velocity vector 4. Assume 1D flow due to defined c.v., then use Eq.18  (where T is the torque) (I) Steady flow:   (clockwise) From (I) : (clockwise) Knowing that  clockwise - Euler equation of pump DO PART (b) ON YOUR OWN"}], "Lecture 7 Notes.pdf": [{"page_number": 0, "text": "Lecture 7 Notes:  etc. etc. Substituting above relationships for into Eqs. 7 - 9 , one has : -     - Underlined In Blue: Convectine term & it is non - linear diff. Eq. - Underlined In Red:inertial terms - Eq(11) is called Navier - Stokes Eq for incompre ss ible fluids o Eq(11) is usually solved by CFD Techniques (Computational Fluid Dynamics) due to non - linearity only a few analytical solutions exists Our Goals for Today (lect. 7) 1 - Cont'd Chapter 4 and introducing differential form of conservation of Angular momentum & energy 2 - Solving sample problems using differential forms of conservation equations 3 - Intro. to irrotational flow & vorticity (time permitting) Sec. 4.4 Diff. Eq.s of Angular Momentum (3rd law) Lets consider the notation around centroid of an element ( 0 , i.e. where Z axis crosses the x - y plane If I write the quation for moment cqlculation I find that For notation around y or x axes, one finds: The above means that there is no diff. Req. Form for conservativation of angular momentum one should use the integral form given in chapter 3 Note 1: all pan through the centroid of the element(0) so they have no moment around 0. Note 2: Fluid similar to solids experfiences symmetric shear stressors. Sec 4.4. Diff. Eq. For Conservation of Energy (4th law) It can be shown that the conservation of energy eq. For an element will be eq.(12):  Note: There is no infinitesimal shaft wor (a mechanical shaft cannot be the size of an element) Need to find differential forms of & 1 - Heat transfer to the element to deal with , we only consider conduction (vast application only have conduction) or in general (3D) coefficient of thermal conductivity"}, {"page_number": 1, "text": "Note: internal elememtal energy is ignored (e.g. chem. Reaction) Th net tranfer to the element in the x - dir.  convetion from heat transfer Considering the conduction in all 3 directions:  (13) 2 - Finding Diff/ Eq. For Viscos Work ( ) = shear force x area x corresponding v e l. So viscos work ( or viscos disipation) in the x - dir: Viscos wotrk out is: Considering all 3 directions:  In Compact form: - (14) - Practical form of Eq(14) where vi scos losses are seperate is as follows: - (15) - - Where  o Only for Newtonian fluids o is always positive (due to all terms having powers of 2), which makes senses, as losses in a flow must be positie to comply with 2nd law of Thermodynamics Sub in Eqs. (13) & (15) into eq(12), cons. Of energy, and after simplificati on (note: , and utilizing the conservation of linear momentum: (16) Eq(16) is the general form of conservation of energy for a flow If we consider the flow in comprenible and  (1 ) dT Total diff. On T(x,y,z,t) dissipation term (if the flow is very very slow, it can be ignored)"}, {"page_number": 2, "text": "How to solve above equations with 5 unknowns (i.e. when we have 3 eqs.? Read Sec 4.6 of the book to learn about various BC - Eq. of state (idel gas law) - Inlet/outlet info. V, p - - Free interface: vertical vel (w) equity & mech. Force balance at the interface ( ) ; or thermal conditions, e.g. equal temp. or equ al thermal flux. Sec 4.10 (For now we will skip Sec 4.7 - 4.9): Read sec 4.10 for analytically solving some special cases here we deal with the example of a Laminin flow within a pipe. Ex: What is the vel. Profile in the pipe shown. Assume the flow is laminin , and fully developed. Neglect the gravity and assume the flow is steady and incompressible. As this is a straight pipe flow can be considered axisymmetric. So! - What co - ordinate system to use? Cyl. - What does axial flow means? A flow that is fully developed is an axial flow - What does axial symmetry mean? - What does it mean that flow is incompressible & =constant with continuity (cons. Of mass): in cyl. Coordinates (see Sec 4.2) has the form  and  where t - steady, axisymmetric, z fully developed Writing N.S. eq. in Cyl. Co - ordinate r - component:  + (r  =0 no gravity"}, {"page_number": 3, "text": "No flow in dire => no eqs. In dire. since Z - dir:   =0 no gravity Integrated w.r.f. r twice:  finite value | =0. R=0 >centaline of pipr, 2nd BC 1st BC no slip at r=R, R=pipe radius Using the 2 BC Eq. of a paraboloid Note: Knowing vel. Profile allows one to find: 1. Flow Rate (Q), i.e. where 2. Shear at the wall (T wall ): T wall= ; L= length of pipe segment prev. Drop along z - dir., for pipe length L. Fig. E6.3.1 shows a coating experiment involving a flat photographic film that is being pulled up from a processing bath by rollers with a steady velocity U at an angle to the horizontal. As the film leaves the bath, it entrains some liquid, and in this particular experiment it has reached the stage where: (a) the velocity of the liqui d i n contact with the film is , (b) the thickne ss of the liquid is constant at a value , and (c) there is no net flow being pulled up by the film as is falling back by gravity). (C learly, if the film were to retain a permanent coating, a n et upwards flow of liquid would be needed.)"}, {"page_number": 4, "text": "te rm ins eq.) Assumptions: - Newtonian fluid, steady flow, =constant - No variation of vel. In 2 dir. => 2D flow - No rotation => no worries for conservation angular momentum => continuity linear momentum Continuity - Linear 2D Momentum:   - Note: Orientation being x or y axis for and - Note: looking from top and side views of the system +> u>>v or w, so we ca n neglect v & w or v=w=0 Momentum:  Continuity note v=0 BC to solve 1. y=0, u=U 2. all free surface shear force(T xy ) is zero, mechanical balance:  3. Since we have a flat interface with the dir. At => P=0 ; gauge at the moment Solve above PDF with the 3 BC: Answer:"}, {"page_number": 5, "text": "Note: N.S eqs. Are complicated, so to find analytical solution, either if the phys. Y problem allows, simplification, e.g. prob. Above, or use of math tech should be done to find solution Otherwise CFD is needed Irrotation flow and vorticity These concept s are math. Tech. to help with finding analytical sol. To POE of NS; see videos If a fluid element does not have an angular vel. Around its center, this flow is called irrotational To do diff. analysis : how irrotationality can be shown mathematically? Avg. rotational vel. Of element around 2 axis ( the sign of operation is the direction of notation 9see fig. above)"}, {"page_number": 6, "text": "By trigonometry, it can be shown Then For rotation around x & y it can be shown:   curl Vorticity - > If or zero vorticity, then flow is irrotational (18) What is this good for? We have a math tool to solve for flow field (get This tool is best suited for 2D flows where there is no work or heat involved since there is no work or heat, I can be concerned with conservation of man & momentum: For an incompressible flow, where flow is steady: (i) (ii) Consider a function exists ( that one can write: (iii) Then by inspection of eq.(iii) vis. a. vis. eq(i): (19) If one taken the curl of momentum Eq. (i.e. , and use definition from eq. 19, then:  (iv ) Eq (iv) is a 4 th order PDE that needs 4BC Aside from driving Eq. (iv) Special Case! Irrotational flow => x =0 in 2D Eq iv) now simplified to a 2 nd order PDE, which needs 2 BC only BC (at far field _ - > very much away from the object) Interestingly, represents stream lines in a physical sense, hence it is called a stream function Definition of stream li ne satisfy It can show that with as flow rate and scalar OR if we write the above same formulation but keep the in the eq. (i)"}, {"page_number": 7, "text": "Therefore the concept of stream function( ) works for both compressible and incompressible flows, but not for 3D or unsteady flow Ex. If a stream function exists for vel. Field as follows, find it, plot it, and interpret it. Looking at vel. Functions - > steady => chance exists  To find - >"}], "Lecture15.pdf": [{"page_number": 0, "text": "Goals for Lect. 15 1. Cont'd from pumps (Chap. 11) Specific speed 2. Introduction to external flow over bodies and its application 3. Boundary layer (BL) for external flows and comparison with internal flows 4. Displacement thickness in BL, and time permitting start of discussion about BL equations Chapter 7 Flow over Immersed Bodies https://www.youtube.com/watch?v=dUhiDctsyfs This type of flow is important for: 1. Airplanes 2. Cars, trains 3. Ships 4. Buildings (CN Tower) - slip\" zone exists ne ar the surfaces; and away from a surface, flow c an be considered invi s cid (can use Euler Equations, see chapter 3) Patch : relate pressure in inviscid region to viscos stress in B.L. Patching is not always possible, so to understand the flow experiment or CFD should be used on theoretical treatment is not available e.g. 1 < Re < 1000 Compassion between External & Internal B.L"}, {"page_number": 1, "text": "INTERNAL EXTERNAL FULLY DEVELOPED? CAN BE NEVER WAKE? NEVER USUALLY PLATE IS EXCEPTION THEORY LAMINAR FLAT PLATE & ZERO PRESSURE GRADIENT GROWING BOUNDARY LAYER? NOT WHEN FULLY DEVELOPED ALWAYS ADVERSE PRESSURE GRADIENT PIPE/DUCT=NO DIFFUSER=YES PLATE =MAYBE BODIES=USUALLY TURBULENT EXPERIMENT PIPE (EXAMPLE) u(r)/U c/l = (y/R) 1/n PLATE(EXAMPLE) U(y)/U o = (y/ 1/n Special case of low Re < 1000"}, {"page_number": 2, "text": "viscous region) before reaching the plate Usually , this flow is seen for and only way to study details of flow is by experiment or CFD Higher Re number flows: In such cas es there is po ssible to find . If flow is laminar, one can show: , x local on the plate calculate Re at local x, B.L. begins at the plate unlike the case for For other bodies above Eq. Will not work ! expermient or CFD If flow is turbulent: (x for plate)"}, {"page_number": 3, "text": "Note a B.L. border is not a streamline (see highlighted region in Fig) Q1. Is growing faster in lam or turbant flow? Q2. Is larger in lam or turbulant flow? Sec 7.2 In chap. 3, we showed that drag (D) on a plate (bx X ) is  (1) Von karman wrote Eq(1) in the form of momentum thickness ( ) (2) (Measure of drag) Wher e Is a measure of drag (momentum deficit) It can be shown (w - wall) (3) Up to now all relationships apply to both lam & turbulent flow. But assuming a parabolic form for u(x), Van Karman showed for a laminar f low: Knowing"}, {"page_number": 4, "text": "Considering Eq (3), we get , within 10% of earlier equation for Q. Why is there a 10% difference? It can be shown that: [Cf skin friction coefficient, for plate] , which is accurate within 10% NOTE: the displacement of the streamline in the free flow by the B.L. to hold the conservation of the mass valid.  Specific (Sec 11.4) If we eliminate D between , and consider the BEP, it can be shown that:  (9), where n rps, H* - head at BEP, Q* - flow rate at BEP (Q gpm (gel/min) Giving, The value of Ns is in that indicates what type of pump design (axial centirfugal, mixed) is the must efficient machine for a given H & Q, see fig 11.11 One can also find the minute required NPSH, by using NPSH specific speed: (11) IF Nss > 1800, pump may cavitate (emperically found)"}, {"page_number": 5, "text": "Consider a pump geometr ically similar to the 9 - in - diameter pump of Fig. P11.34 to deliver 1200 gal/min of kerosene at 1500 rpm. Determine the appropriate (a) impeller diameter; (b) shut - off head; (c) maximum efficiency; and (d) BEP horsepower. The pump rotational speed for water is 1760 RPM Eq(5) water 449 conversation of gpm to ft 3/9 1760 RPM of pump read off chart 60 to conv to RPS 12 conv. Ft Rever sive (see the note):  Shuff_off Eq(4)   Usingg Eq(8)  (0 .77 - read that off the chart) Using Eq 5 for Cp:"}, {"page_number": 6, "text": "P11.65 An 11.5 - in diameter centrifugal pump, running at 1750 rev/min, delivers 850 gal/min and a head of 105 ft at best efficiency (82%). (a)Can t his pump operate efficiently when delivering water at 20°C through 200 m of 10 - cm - diameter smooth pipe? Neglect minor losses. (b)If your answer to (a) is negative, can the speed n be changed to operate efficiently? (c)If your answer to (b) is also negative , can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min? (a)Can this pump operate efficiently when delivering water at 20°C through 200 m of 10 - cm - diameter smooth pipe? Neglect minor losses. For water at , Convert to SI units:  Compute Red and f:   (a) Now compute the friction head loss at 850 gal.min and see if it matches the pump head:"}, {"page_number": 7, "text": "(b) If your answer to (a) is negative, can the speed be changed to operate efficiently? At BEP, ( gH/n 2 D 2 ) is constant, therefore pump head is proportional to n 2 . But the pipe friction loss is also approximately proportional to n 2 . Thus, for any speed n , the pipe head will always be about twice as large as the pump head and not operate efficiently (c)If your answer to (b) is also negative, can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min? This time the answer i s Yes. First note the BEP dimensionless parameters, = 1750/60=29.2 rps:   Now combine these with that fact that h f is approximately propotional to n 2 . In SI units,  (c)If your answer to (b) is also negative, can the impeller diameter be changed to operate efficiently and still run at 1750 rev/min?   inches Ans(c.) This is approximately correct. Check: the pump head i s 22.4 m(74 ft) and flow rate is 497 gal/min. For this flow rate, the pipe head loss is 22.3 m (73 ft). NOTE: Part (c) is almost independent of n . For example, if n =20 rev/s, the best efficiency converges to an impeller diameter of 0,24 m (9.45 in), with Q 323 gal/min and Fig. Chap 11: Basic Principle s and History of Industrial Pumps https://www.youtube.com/watch?v=eWachJNuxSU"}, {"page_number": 8, "text": "Breast Pump : Ameda:History of the Breast Pump https://www.youtube.com/watch?v=2U0s5D8maNk&ab_channel=MyAmeda"}, {"page_number": 12, "text": "Piping system characteristic curve to intersect pump char. curve at or near BEP to have an efficient pumping system. Fig 11.10 Given curve by C Q"}, {"page_number": 13, "text": "Figure 11.8"}, {"page_number": 14, "text": "Euler"}], "Lectures 2.pdf": [{"page_number": 0, "text": "First Lecture Who is stronger a solid or a fluid? Our Goals for Today (lect. 2) 1. Understand shear stress in liquids 2. Viscosity & its temperature and pressure dependance Before we start... What are we after in Studying Fluid Dynamics? 1. Pressure field/values 2. Velocity Field a. Work b. Forces c. Power d. Losses i. Pressure ii. Drag/resistive force What is the main difference between a solid and a liquid? - Fluids do not keep their shape under any stress - Stems from ability of liquid molecules to move around"}, {"page_number": 1, "text": "Aside : the terms Fluid Dynamics and Fluid Mechanics are used interchangeably in this course and mean large ly the same thing Solid vs Fluid A solid can resist a shear stress ( ) by a static deformation, but a fluid cannot! What happens when a fluid e xperiences a s hear stress? It flows! At a given time, t, The larger the A constant shear stress, causes a strain ( that is changing with time, at a rate of . Eq (1) Where is the viscosity ( proportionality constant ) Viscosity is the resistance of a fluid to motion. unit is or or 1 cP (centi - poise) Viscosity is a thermodynamic property, so: Where T = temperature and P = Pressure"}, {"page_number": 2, "text": "changes significantly with temperature. For gases, K now n at (273K) n is a constant (for air 0.7) But for liquids, decreases with temp erature a and b are c onstants that depend on the type of liquid why different between gas & liquid? , so does for all fluids . If is divided by fluid density ( , it is called kinematic viscosity ( v). ) For water v = 1c or (unlike solid mechanics) , but care about velocity ma tch strain to velocity. (for small strains & elements )  From Eqs. (2 & 3):"}, {"page_number": 3, "text": "Example: Skating on ICE! the relative profile within the liquid film? Assumption : 1 The flow is one dimensional in x - direction, i.e. u(x) = u(z) = 0"}, {"page_number": 4, "text": "2 no pressure variation in x direction F rom force balance If the person is not accelerating, then is a consta nt, is a constant (water), then the integral can be solved as: B.C. at y = 0 u = 0 a = 0 at y = h u = v v = 0 + ( linear velocity profile ) 1. Viscosity charge with T&P 2. Intermolecular forces is the origin if viscosity 3. Difference between solid & liquid in terms of strain 4. Prop ortionality between velocity & shear stress"}], "Lectures 4.pdf": [{"page_number": 0, "text": "Our Goals for Today (lect. 3) 1. Non - Newtonian Fluids 2. Various ways to study fluid dynamics Newtonian vs Non - Newto nian Fluid See the PPT There are three fundamental ways to study fluid mechanics 1. Integral approach 2. Differential approach 1. Mostly done these days using CFD (Computational Fluid Dynamics) 3. Experimental approach Many times, a combination of these approaches lead to the best or most efficient solution Integral approach When flow is analyzed on a system level basis, e.g. using a control volume enco mpassing the system (a pump, or an airfoil) Used when Details of flow are not interesting but the overall effect or outcome of it are important (e.g. pump work, or lift on an airfoil) Usually less labor or resource intensive than differential method Differential analysis"}, {"page_number": 1, "text": "We calculate flow at every point in the flow field i.e. (x,y,z,t). So the flow properties like P, T, and characteristics, e.g. Vel. Is know at every point Such detailed knowledge useful for understanding flow separation, (drag and lift), or pressure loss at fittings, etc. Need to solve the differential equations of motion, or detailed experiments (e.g. using PIV method) A costly approach Experimental Approach Example: use of PIV (particle image velocimetry) to understand flow field"}, {"page_number": 2, "text": "Flow visualization Stream line stream tube Streamlines show local flow direction , not velocity! Velocity normally varies along a streamline"}, {"page_number": 3, "text": "Eularian and Lagrangian frames of reference Two methods to describe fluid motion (usually mathematically), but same answer! The Eularian approach focuses on fluid properties/velocity at a point (x,y,z,t). This is a field approach. Used in majority of cases and intuitive In Lagrangian approach a particle or a group of particles are followed in time. This is a bit of cumbersome method of an alysis Useful for cases such as particle laden flows (drug delivery to lung), or two phase flow involving bubbles (oil industry)."}]}